*** src/main.rs:113:37: replace == with != in run_analyze

*** mutation diff:
--- src/main.rs
+++ replace == with != in run_analyze
@@ -105,17 +105,17 @@
     arp_spoof_threshold: u32,
     arp_storm_rate: u32,
     show_mitre_grouping: bool,
     collapse_findings: bool,
     use_color: bool,
     cli: &Cli,
 ) -> Result<()> {
     // BC-2.14.024 §P3a/P3b: validate thresholds before constructing the analyzer.
-    if modbus_write_burst_threshold == 0 {
+    if modbus_write_burst_threshold != /* ~ changed by cargo-mutants ~ */ 0 {
         anyhow::bail!("--modbus-write-burst-threshold must be >= 1 (got 0)");
     }
     if modbus_write_sustained_threshold == 0 {
         anyhow::bail!("--modbus-write-sustained-threshold must be >= 1 (got 0)");
     }
     // BC-2.16.008 EC-006 / BC-2.16.012 EC-004 / BC-2.16.013 EC-004 / D-074:
     // Reject zero thresholds before constructing the ARP analyzer, mirroring
     // the modbus guards above.  Value 0 is rejected here so that the D3 storm

---- story_105::test_BC_2_14_023_modbus_with_no_reassemble_prints_warning stdout ----

thread 'story_105::test_BC_2_14_023_modbus_with_no_reassemble_prints_warning' (177029548) panicked at tests/bc_2_14_105_modbus_dispatch_tests.rs:539:9:
exit code must be 0

---- story_105::test_BC_2_14_023_modbus_flag_enables_analyzer_empty_pcap stdout ----

thread 'story_105::test_BC_2_14_023_modbus_flag_enables_analyzer_empty_pcap' (177029547) panicked at tests/bc_2_14_105_modbus_dispatch_tests.rs:450:14:
Unexpected failure.
code=1
stderr=```"Error: --modbus-write-burst-threshold must be >= 1 (got 0)\n"```
command=`"/private/var/folders/p5/tjcpsj_90sd8b2t321cqpf600000gn/T/cargo-mutants-wirerust-ePVJFG.tmp/target/debug/wirerust" "analyze" "--modbus" "--json" "/var/folders/p5/tjcpsj_90sd8b2t321cqpf600000gn/T/.tmpKF9ILj/out.json" "tests/fixtures/http-ooo.pcap"`
code=1
stdout=""
stderr="Error: --modbus-write-burst-threshold must be >= 1 (got 0)\n"

---- story_105::test_BC_2_14_024_sustained_threshold_zero_rejected stdout ----

thread 'story_105::test_BC_2_14_024_sustained_threshold_zero_rejected' (177029553) panicked at tests/bc_2_14_105_modbus_dispatch_tests.rs:624:9:
Error message must mention the sustained threshold (BC-2.14.024 P3b), got: "Error: --modbus-write-burst-threshold must be >= 1 (got 0)\n"

failures:
    story_105::test_BC_2_14_023_all_flag_enables_modbus
    story_105::test_BC_2_14_023_modbus_alone_triggers_reassembly
    story_105::test_BC_2_14_023_modbus_disabled_by_default
    story_105::test_BC_2_14_023_modbus_flag_enables_analyzer_empty_pcap
    story_105::test_BC_2_14_023_modbus_with_no_reassemble_prints_warning
    story_105::test_BC_2_14_024_burst_threshold_zero_rejected
    story_105::test_BC_2_14_024_sustained_threshold_zero_rejected

test result: FAILED. 23 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.39s

*** result: Failure(101)
