*** src/main.rs:123:23: replace == with != in run_analyze

*** mutation diff:
--- src/main.rs
+++ replace == with != in run_analyze
@@ -115,17 +115,17 @@
     }
     if modbus_write_sustained_threshold == 0 {
         anyhow::bail!("--modbus-write-sustained-threshold must be >= 1 (got 0)");
     }
     // BC-2.16.008 EC-006 / BC-2.16.012 EC-004 / BC-2.16.013 EC-004 / D-074:
     // Reject zero thresholds before constructing the ARP analyzer, mirroring
     // the modbus guards above.  Value 0 is rejected here so that the D3 storm
     // detector and spoof detector never operate with degenerate parameters.
-    if arp_storm_rate == 0 {
+    if arp_storm_rate != /* ~ changed by cargo-mutants ~ */ 0 {
         anyhow::bail!("--arp-storm-rate must be >= 1 (got 0)");
     }
     if arp_spoof_threshold == 0 {
         anyhow::bail!("--arp-spoof-threshold must be >= 1 (got 0)");
     }
 
     let mut summary = Summary::new();
     let mut dns_analyzer = DnsAnalyzer::new();

---- story_105::test_BC_2_14_023_modbus_disabled_by_default stdout ----

thread 'story_105::test_BC_2_14_023_modbus_disabled_by_default' (177031397) panicked at tests/bc_2_14_105_modbus_dispatch_tests.rs:400:14:
Unexpected failure.
code=1
stderr=```"Error: --arp-storm-rate must be >= 1 (got 0)\n"```
command=`"/private/var/folders/p5/tjcpsj_90sd8b2t321cqpf600000gn/T/cargo-mutants-wirerust-ePVJFG.tmp/target/debug/wirerust" "analyze" "--http" "--json" "/var/folders/p5/tjcpsj_90sd8b2t321cqpf600000gn/T/.tmpwyjFaR/out.json" "tests/fixtures/http-ooo.pcap"`
code=1
stdout=""
stderr="Error: --arp-storm-rate must be >= 1 (got 0)\n"

---- story_105::test_BC_2_14_023_modbus_alone_triggers_reassembly stdout ----

thread 'story_105::test_BC_2_14_023_modbus_alone_triggers_reassembly' (177031396) panicked at tests/bc_2_14_105_modbus_dispatch_tests.rs:703:10:
Unexpected failure.
code=1
stderr=```"Error: --arp-storm-rate must be >= 1 (got 0)\n"```
command=`"/private/var/folders/p5/tjcpsj_90sd8b2t321cqpf600000gn/T/cargo-mutants-wirerust-ePVJFG.tmp/target/debug/wirerust" "analyze" "--modbus" "--json" "/var/folders/p5/tjcpsj_90sd8b2t321cqpf600000gn/T/.tmpIpnA9o/out.json" "tests/fixtures/http-ooo.pcap"`
code=1
stdout=""
stderr="Error: --arp-storm-rate must be >= 1 (got 0)\n"

---- story_105::test_BC_2_14_023_modbus_with_no_reassemble_prints_warning stdout ----

thread 'story_105::test_BC_2_14_023_modbus_with_no_reassemble_prints_warning' (177031399) panicked at tests/bc_2_14_105_modbus_dispatch_tests.rs:539:9:
exit code must be 0

failures:
    story_105::test_BC_2_14_023_all_flag_enables_modbus
    story_105::test_BC_2_14_023_modbus_alone_triggers_reassembly
    story_105::test_BC_2_14_023_modbus_disabled_by_default
    story_105::test_BC_2_14_023_modbus_flag_enables_analyzer_empty_pcap
    story_105::test_BC_2_14_023_modbus_with_no_reassemble_prints_warning

test result: FAILED. 25 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.31s

*** result: Failure(101)
