*** src/main.rs:146:24: replace || with && in run_analyze

*** mutation diff:
--- src/main.rs
+++ replace || with && in run_analyze
@@ -138,17 +138,17 @@
     let mut all_findings = Vec::new();
     let mut total_decode_errors: u64 = 0;
 
     let skip_reassembly = cli.no_reassemble;
 
     // BC-2.14.023 §P4: needs_reassembly includes enable_modbus / enable_dnp3 so that
     // --modbus or --dnp3 alone (without --http or --tls) activates the reassembly engine.
     let needs_reassembly =
-        cli.reassemble || enable_http || enable_tls || enable_modbus || enable_dnp3;
+        cli.reassemble && /* ~ changed by cargo-mutants ~ */ enable_http || enable_tls || enable_modbus || enable_dnp3;
 
     if (enable_http || enable_tls) && skip_reassembly {
         eprintln!(
             "Warning: --http/--tls require TCP reassembly, but --no-reassemble is set. Stream analysis will be skipped."
         );
     }
     // BC-2.14.023 §P2 sub-case (EC-001): warn and omit Modbus when reassembly disabled.
     if enable_modbus && skip_reassembly {

---- hs043::test_BC_2_04_013_v15_cli_flow_timeout_arg_produces_flows_expired stdout ----

thread 'hs043::test_BC_2_04_013_v15_cli_flow_timeout_arg_produces_flows_expired' (177047614) panicked at tests/hs043_flow_expiry_tests.rs:404:14:
TCP Reassembly analyzer summary must be present in JSON output

failures:
    hs043::test_BC_2_04_013_v15_cli_flow_timeout_arg_produces_flows_expired

test result: FAILED. 7 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
