*** src/main.rs:146:39: replace || with && in run_analyze

*** mutation diff:
--- src/main.rs
+++ replace || with && in run_analyze
@@ -138,17 +138,17 @@
     let mut all_findings = Vec::new();
     let mut total_decode_errors: u64 = 0;
 
     let skip_reassembly = cli.no_reassemble;
 
     // BC-2.14.023 §P4: needs_reassembly includes enable_modbus / enable_dnp3 so that
     // --modbus or --dnp3 alone (without --http or --tls) activates the reassembly engine.
     let needs_reassembly =
-        cli.reassemble || enable_http || enable_tls || enable_modbus || enable_dnp3;
+        cli.reassemble || enable_http && /* ~ changed by cargo-mutants ~ */ enable_tls || enable_modbus || enable_dnp3;
 
     if (enable_http || enable_tls) && skip_reassembly {
         eprintln!(
             "Warning: --http/--tls require TCP reassembly, but --no-reassemble is set. Stream analysis will be skipped."
         );
     }
     // BC-2.14.023 §P2 sub-case (EC-001): warn and omit Modbus when reassembly disabled.
     if enable_modbus && skip_reassembly {

---- story_089::test_EC_002_unclassified_flows_zero_still_present_in_detail stdout ----

thread 'story_089::test_EC_002_unclassified_flows_zero_still_present_in_detail' (177044428) panicked at tests/main_story_089_tests.rs:639:14:
Unexpected stdout, failed var.contains("unclassified_flows": 0)
├── var: {
│     "analyzers": [
│       {
│         "analyzer_name": "HTTP",
│         "detail": {
│           "methods": {},
│           "non_http_flows": 0,
│           "parse_errors": 0,
│           "poisoned_bytes_skipped": 0,
│           "recent_uris": [],

---- story_089::test_unclassified_flows_injected_into_reassembly_summary stdout ----

thread 'story_089::test_unclassified_flows_injected_into_reassembly_summary' (177044511) panicked at tests/main_story_089_tests.rs:277:14:
Unexpected stdout, failed var.contains("unclassified_flows": 8)
├── var: {
│     "analyzers": [
│       {
│         "analyzer_name": "HTTP",
│         "detail": {
│           "methods": {},
│           "non_http_flows": 0,
│           "parse_errors": 0,
│           "poisoned_bytes_skipped": 0,
│           "recent_uris": [],

failures:
    story_089::test_EC_002_unclassified_flows_zero_still_present_in_detail
    story_089::test_unclassified_flows_injected_into_reassembly_summary

test result: FAILED. 23 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
