*** src/main.rs:146:70: replace || with && in run_analyze

*** mutation diff:
--- src/main.rs
+++ replace || with && in run_analyze
@@ -138,17 +138,17 @@
     let mut all_findings = Vec::new();
     let mut total_decode_errors: u64 = 0;
 
     let skip_reassembly = cli.no_reassemble;
 
     // BC-2.14.023 §P4: needs_reassembly includes enable_modbus / enable_dnp3 so that
     // --modbus or --dnp3 alone (without --http or --tls) activates the reassembly engine.
     let needs_reassembly =
-        cli.reassemble || enable_http || enable_tls || enable_modbus || enable_dnp3;
+        cli.reassemble || enable_http || enable_tls || enable_modbus && /* ~ changed by cargo-mutants ~ */ enable_dnp3;
 
     if (enable_http || enable_tls) && skip_reassembly {
         eprintln!(
             "Warning: --http/--tls require TCP reassembly, but --no-reassemble is set. Stream analysis will be skipped."
         );
     }
     // BC-2.14.023 §P2 sub-case (EC-001): warn and omit Modbus when reassembly disabled.
     if enable_modbus && skip_reassembly {

---- modbus_e2e::test_BC_2_14_021_modbus_summary_pdu_count_equals_four stdout ----

thread 'modbus_e2e::test_BC_2_14_021_modbus_summary_pdu_count_equals_four' (177037405) panicked at tests/modbus_e2e_tests.rs:156:9:
assertion `left == right` failed: fixture has exactly 4 Modbus ADUs: FC=0x11(req), FC=0x11(resp), FC=0x10(write), FC=0x90(exc); got 0
  left: 0
 right: 4

---- modbus_e2e::test_BC_2_09_007_finding_timestamps_have_correct_year stdout ----

thread 'modbus_e2e::test_BC_2_09_007_finding_timestamps_have_correct_year' (177037399) panicked at tests/modbus_e2e_tests.rs:308:9:
findings must be non-empty to assert timestamp provenance

---- modbus_e2e::test_BC_2_14_013_findings_contain_modbus_write_T1692_001_T0836 stdout ----

thread 'modbus_e2e::test_BC_2_14_013_findings_contain_modbus_write_T1692_001_T0836' (177037400) panicked at tests/modbus_e2e_tests.rs:206:9:
findings array must not be empty; fixture should produce write and recon findings

failures:
    modbus_e2e::test_BC_2_09_007_finding_timestamps_have_correct_year
    modbus_e2e::test_BC_2_14_013_findings_contain_modbus_write_T1692_001_T0836
    modbus_e2e::test_BC_2_14_020_findings_contain_modbus_recon_T0888
    modbus_e2e::test_BC_2_14_020_recon_finding_count_two
    modbus_e2e::test_BC_2_14_021_modbus_summary_exception_count_nonzero
    modbus_e2e::test_BC_2_14_021_modbus_summary_in_analyzers_array
    modbus_e2e::test_BC_2_14_021_modbus_summary_pdu_count_equals_four

test result: FAILED. 2 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
