*** src/main.rs:148:21: replace || with && in run_analyze

*** mutation diff:
--- src/main.rs
+++ replace || with && in run_analyze
@@ -140,17 +140,17 @@
 
     let skip_reassembly = cli.no_reassemble;
 
     // BC-2.14.023 §P4: needs_reassembly includes enable_modbus / enable_dnp3 so that
     // --modbus or --dnp3 alone (without --http or --tls) activates the reassembly engine.
     let needs_reassembly =
         cli.reassemble || enable_http || enable_tls || enable_modbus || enable_dnp3;
 
-    if (enable_http || enable_tls) && skip_reassembly {
+    if (enable_http && /* ~ changed by cargo-mutants ~ */ enable_tls) && skip_reassembly {
         eprintln!(
             "Warning: --http/--tls require TCP reassembly, but --no-reassemble is set. Stream analysis will be skipped."
         );
     }
     // BC-2.14.023 §P2 sub-case (EC-001): warn and omit Modbus when reassembly disabled.
     if enable_modbus && skip_reassembly {
         eprintln!(
             "WARNING: --modbus requires stream reassembly; ignoring --modbus \

---- story_088::test_no_reassemble_with_http_emits_warning stdout ----

thread 'story_088::test_no_reassemble_with_http_emits_warning' (177054265) panicked at tests/main_story_088_tests.rs:198:14:
Unexpected stderr, failed var.contains(Warning: --http/--tls require TCP reassembly, but --no-reassemble is set. Stream analysis will be skipped.)
├── var: 
└── var as str: 

command=`"/private/var/folders/p5/tjcpsj_90sd8b2t321cqpf600000gn/T/cargo-mutants-wirerust-ePVJFG.tmp/target/debug/wirerust" "analyze" "tests/fixtures/http-ooo.pcap" "--http" "--no-reassemble"`
code=0
stdout=```
\x1b\x1bWIRERUST TRIAGE REPORT\x1b\x1b
────────────────────────────────────────
  Packets: 16  Bytes: 929  Hosts: 2

failures:
    story_088::test_no_reassemble_with_http_emits_warning

test result: FAILED. 18 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
