*** src/main.rs:168:50: delete ! in run_analyze

*** mutation diff:
--- src/main.rs
+++ delete ! in run_analyze
@@ -160,17 +160,17 @@
     // BC-2.15.021: warn and omit DNP3 when reassembly disabled.
     if enable_dnp3 && skip_reassembly {
         eprintln!(
             "WARNING: --dnp3 requires stream reassembly; ignoring --dnp3 \
              (pass --reassemble or omit --no-reassemble)"
         );
     }
 
-    let mut reassembler = if needs_reassembly && !skip_reassembly {
+    let mut reassembler = if needs_reassembly &&  /* ~ changed by cargo-mutants ~ */skip_reassembly {
         let mut config = ReassemblyConfig {
             max_depth: cli.reassembly_depth * 1_048_576,
             memcap: cli.reassembly_memcap * 1_048_576,
             ..ReassemblyConfig::default()
         };
         // LESSON-P2.05: anomaly thresholds are CLI-overridable; an
         // absent flag leaves the `ReassemblyConfig::default()` value.
         if let Some(v) = cli.overlap_threshold {

---- mitre_flag_emits_tactic_headers_and_collapse_suffix stdout ----

thread 'mitre_flag_emits_tactic_headers_and_collapse_suffix' (177073453) panicked at tests/cli_integration_tests.rs:209:5:
BC-2.11.030 PC-2: `--mitre` must emit MITRE tactic section headers ('## '); got stdout:
WIRERUST TRIAGE REPORT
────────────────────────────────────────
  Packets: 16  Bytes: 929  Hosts: 2

PROTOCOLS
────────────────────────────────────────
  Tcp: 16

SERVICES
────────────────────────────────────────

---- mitre_no_collapse_emits_tactic_headers_without_collapse_suffix stdout ----

thread 'mitre_no_collapse_emits_tactic_headers_without_collapse_suffix' (177073454) panicked at tests/cli_integration_tests.rs:237:5:
BC-2.11.030 PC-3: `--mitre --no-collapse` must emit MITRE tactic headers ('## '); got stdout:
WIRERUST TRIAGE REPORT
────────────────────────────────────────
  Packets: 16  Bytes: 929  Hosts: 2

PROTOCOLS
────────────────────────────────────────
  Tcp: 16

SERVICES
────────────────────────────────────────

---- csv_flag_with_path_writes_csv_findings_table stdout ----

thread 'csv_flag_with_path_writes_csv_findings_table' (177073448) panicked at tests/cli_integration_tests.rs:106:5:
CSV must contain at least one finding row for the --all analysis of the fixture

failures:
    csv_flag_with_path_writes_csv_findings_table
    mitre_flag_emits_tactic_headers_and_collapse_suffix
    mitre_no_collapse_emits_tactic_headers_without_collapse_suffix

test result: FAILED. 6 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
