*** src/main.rs:170:45: replace * with / in run_analyze

*** mutation diff:
--- src/main.rs
+++ replace * with / in run_analyze
@@ -162,17 +162,17 @@
         eprintln!(
             "WARNING: --dnp3 requires stream reassembly; ignoring --dnp3 \
              (pass --reassemble or omit --no-reassemble)"
         );
     }
 
     let mut reassembler = if needs_reassembly && !skip_reassembly {
         let mut config = ReassemblyConfig {
-            max_depth: cli.reassembly_depth * 1_048_576,
+            max_depth: cli.reassembly_depth / /* ~ changed by cargo-mutants ~ */ 1_048_576,
             memcap: cli.reassembly_memcap * 1_048_576,
             ..ReassemblyConfig::default()
         };
         // LESSON-P2.05: anomaly thresholds are CLI-overridable; an
         // absent flag leaves the `ReassemblyConfig::default()` value.
         if let Some(v) = cli.overlap_threshold {
             config.overlap_alert_threshold = v;
         }

---- story_105::test_BC_2_14_023_modbus_disabled_by_default stdout ----

thread 'story_105::test_BC_2_14_023_modbus_disabled_by_default' (177092023) panicked at tests/bc_2_14_105_modbus_dispatch_tests.rs:400:14:
Unexpected failure.
code=101
stderr=``````

thread \'main\' (177092042) panicked at src/reassembly/mod.rs:117:9:
max_depth must be > 0
```
```
command=`"/private/var/folders/p5/tjcpsj_90sd8b2t321cqpf600000gn/T/cargo-mutants-wirerust-ePVJFG.tmp/target/debug/wirerust" "analyze" "--http" "--json" "/var/folders/p5/tjcpsj_90sd8b2t321cqpf600000gn/T/.tmpgPZdjS/out.json" "tests/fixtures/http-ooo.pcap"`
code=101
stdout=""

---- story_105::test_BC_2_14_023_modbus_flag_enables_analyzer_empty_pcap stdout ----

thread 'story_105::test_BC_2_14_023_modbus_flag_enables_analyzer_empty_pcap' (177092024) panicked at tests/bc_2_14_105_modbus_dispatch_tests.rs:450:14:
Unexpected failure.
code=101
stderr=``````

thread \'main\' (177092045) panicked at src/reassembly/mod.rs:117:9:
max_depth must be > 0
```
```
command=`"/private/var/folders/p5/tjcpsj_90sd8b2t321cqpf600000gn/T/cargo-mutants-wirerust-ePVJFG.tmp/target/debug/wirerust" "analyze" "--modbus" "--json" "/var/folders/p5/tjcpsj_90sd8b2t321cqpf600000gn/T/.tmpkfGAlT/out.json" "tests/fixtures/http-ooo.pcap"`
code=101
stdout=""

---- story_105::test_BC_2_14_023_modbus_alone_triggers_reassembly stdout ----

thread 'story_105::test_BC_2_14_023_modbus_alone_triggers_reassembly' (177092022) panicked at tests/bc_2_14_105_modbus_dispatch_tests.rs:703:10:
Unexpected failure.
code=101
stderr=``````

thread \'main\' (177092041) panicked at src/reassembly/mod.rs:117:9:
max_depth must be > 0
```
```
command=`"/private/var/folders/p5/tjcpsj_90sd8b2t321cqpf600000gn/T/cargo-mutants-wirerust-ePVJFG.tmp/target/debug/wirerust" "analyze" "--modbus" "--json" "/var/folders/p5/tjcpsj_90sd8b2t321cqpf600000gn/T/.tmpPyG0LA/out.json" "tests/fixtures/http-ooo.pcap"`
code=101
stdout=""

failures:
    story_105::test_BC_2_14_023_all_flag_enables_modbus
    story_105::test_BC_2_14_023_modbus_alone_triggers_reassembly
    story_105::test_BC_2_14_023_modbus_disabled_by_default
    story_105::test_BC_2_14_023_modbus_flag_enables_analyzer_empty_pcap

test result: FAILED. 26 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.30s

*** result: Failure(101)
