*** src/main.rs:171:13: delete field memcap from struct ReassemblyConfig expression in run_analyze

*** mutation diff:
--- src/main.rs
+++ delete field memcap from struct ReassemblyConfig expression in run_analyze
@@ -163,17 +163,17 @@
             "WARNING: --dnp3 requires stream reassembly; ignoring --dnp3 \
              (pass --reassemble or omit --no-reassemble)"
         );
     }
 
     let mut reassembler = if needs_reassembly && !skip_reassembly {
         let mut config = ReassemblyConfig {
             max_depth: cli.reassembly_depth * 1_048_576,
-            memcap: cli.reassembly_memcap * 1_048_576,
+             /* ~ changed by cargo-mutants ~ */
             ..ReassemblyConfig::default()
         };
         // LESSON-P2.05: anomaly thresholds are CLI-overridable; an
         // absent flag leaves the `ReassemblyConfig::default()` value.
         if let Some(v) = cli.overlap_threshold {
             config.overlap_alert_threshold = v;
         }
         if let Some(v) = cli.small_segment_threshold {

*** result: Success
