*** src/main.rs:171:43: replace * with / in run_analyze

*** mutation diff:
--- src/main.rs
+++ replace * with / in run_analyze
@@ -163,17 +163,17 @@
             "WARNING: --dnp3 requires stream reassembly; ignoring --dnp3 \
              (pass --reassemble or omit --no-reassemble)"
         );
     }
 
     let mut reassembler = if needs_reassembly && !skip_reassembly {
         let mut config = ReassemblyConfig {
             max_depth: cli.reassembly_depth * 1_048_576,
-            memcap: cli.reassembly_memcap * 1_048_576,
+            memcap: cli.reassembly_memcap / /* ~ changed by cargo-mutants ~ */ 1_048_576,
             ..ReassemblyConfig::default()
         };
         // LESSON-P2.05: anomaly thresholds are CLI-overridable; an
         // absent flag leaves the `ReassemblyConfig::default()` value.
         if let Some(v) = cli.overlap_threshold {
             config.overlap_alert_threshold = v;
         }
         if let Some(v) = cli.small_segment_threshold {

---- story_105::test_BC_2_14_023_modbus_flag_enables_analyzer_empty_pcap stdout ----

thread 'story_105::test_BC_2_14_023_modbus_flag_enables_analyzer_empty_pcap' (177099609) panicked at tests/bc_2_14_105_modbus_dispatch_tests.rs:450:14:
Unexpected failure.
code=101
stderr=``````

thread \'main\' (177099633) panicked at src/reassembly/mod.rs:118:9:
memcap must be > 0
```
```
command=`"/private/var/folders/p5/tjcpsj_90sd8b2t321cqpf600000gn/T/cargo-mutants-wirerust-ePVJFG.tmp/target/debug/wirerust" "analyze" "--modbus" "--json" "/var/folders/p5/tjcpsj_90sd8b2t321cqpf600000gn/T/.tmprCCqez/out.json" "tests/fixtures/http-ooo.pcap"`
code=101
stdout=""

---- story_105::test_BC_2_14_023_all_flag_enables_modbus stdout ----

thread 'story_105::test_BC_2_14_023_all_flag_enables_modbus' (177099606) panicked at tests/bc_2_14_105_modbus_dispatch_tests.rs:489:14:
Unexpected failure.
code=101
stderr=``````

thread \'main\' (177099637) panicked at src/reassembly/mod.rs:118:9:
memcap must be > 0
```
```
command=`"/private/var/folders/p5/tjcpsj_90sd8b2t321cqpf600000gn/T/cargo-mutants-wirerust-ePVJFG.tmp/target/debug/wirerust" "analyze" "--all" "--json" "/var/folders/p5/tjcpsj_90sd8b2t321cqpf600000gn/T/.tmpg1Tmau/out.json" "tests/fixtures/http-ooo.pcap"`
code=101
stdout=""

---- story_105::test_BC_2_14_023_modbus_alone_triggers_reassembly stdout ----

thread 'story_105::test_BC_2_14_023_modbus_alone_triggers_reassembly' (177099607) panicked at tests/bc_2_14_105_modbus_dispatch_tests.rs:703:10:
Unexpected failure.
code=101
stderr=``````

thread \'main\' (177099640) panicked at src/reassembly/mod.rs:118:9:
memcap must be > 0
```
```
command=`"/private/var/folders/p5/tjcpsj_90sd8b2t321cqpf600000gn/T/cargo-mutants-wirerust-ePVJFG.tmp/target/debug/wirerust" "analyze" "--modbus" "--json" "/var/folders/p5/tjcpsj_90sd8b2t321cqpf600000gn/T/.tmp7n3B8q/out.json" "tests/fixtures/http-ooo.pcap"`
code=101
stdout=""

failures:
    story_105::test_BC_2_14_023_all_flag_enables_modbus
    story_105::test_BC_2_14_023_modbus_alone_triggers_reassembly
    story_105::test_BC_2_14_023_modbus_disabled_by_default
    story_105::test_BC_2_14_023_modbus_flag_enables_analyzer_empty_pcap

test result: FAILED. 26 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.33s

*** result: Failure(101)
