*** src/main.rs:200:40: replace && with || in run_analyze

*** mutation diff:
--- src/main.rs
+++ replace && with || in run_analyze
@@ -192,17 +192,17 @@
         // u64 → u32 saturating cast: values above u32::MAX (~136 years) clamp
         // to u32::MAX, which is a safe, non-silent default for any real capture.
         config.flow_timeout_secs = cli.flow_timeout.min(u64::from(u32::MAX)) as u32;
         Some(TcpReassembler::new(config))
     } else {
         None
     };
 
-    let http_analyzer = if enable_http && !skip_reassembly {
+    let http_analyzer = if enable_http || /* ~ changed by cargo-mutants ~ */ !skip_reassembly {
         Some(HttpAnalyzer::new())
     } else {
         None
     };
     let tls_analyzer = if enable_tls && !skip_reassembly {
         Some(TlsAnalyzer::new())
     } else {
         None

---- story_088::test_no_reassemble_skips_http_and_tls_constructors stdout ----

thread 'story_088::test_no_reassemble_skips_http_and_tls_constructors' (177103004) panicked at tests/main_story_088_tests.rs:232:14:
Unexpected stdout, failed (! var.contains(ANALYZER: HTTP))
├── var as str: WIRERUST TRIAGE REPORT
│   ────────────────────────────────────────
│     Packets: 16  Bytes: 929  Hosts: 2
│   
│   PROTOCOLS
│   ────────────────────────────────────────
│     Tcp: 16
│   
│   SERVICES
│   ────────────────────────────────────────

---- story_088::test_needs_reassembly_formula stdout ----

thread 'story_088::test_needs_reassembly_formula' (177103002) panicked at tests/main_story_088_tests.rs:168:14:
Unexpected stdout, failed (! var.contains(ANALYZER: HTTP))
├── var as str: WIRERUST TRIAGE REPORT
│   ────────────────────────────────────────
│     Packets: 16  Bytes: 929  Hosts: 2
│   
│   PROTOCOLS
│   ────────────────────────────────────────
│     Tcp: 16
│   
│   SERVICES
│   ────────────────────────────────────────

---- story_088::test_all_flag_enables_all_three_analyzers stdout ----

thread 'story_088::test_all_flag_enables_all_three_analyzers' (177103000) panicked at tests/main_story_088_tests.rs:94:14:
Unexpected stdout, failed (! var.contains(ANALYZER: HTTP))
├── var as str: WIRERUST TRIAGE REPORT
│   ────────────────────────────────────────
│     Packets: 16  Bytes: 929  Hosts: 2
│   
│   PROTOCOLS
│   ────────────────────────────────────────
│     Tcp: 16
│   
│   SERVICES
│   ────────────────────────────────────────

failures:
    story_088::test_all_flag_enables_all_three_analyzers
    story_088::test_needs_reassembly_formula
    story_088::test_no_reassemble_skips_http_and_tls_constructors

test result: FAILED. 16 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
