*** src/main.rs:200:43: delete ! in run_analyze

*** mutation diff:
--- src/main.rs
+++ delete ! in run_analyze
@@ -192,17 +192,17 @@
         // u64 → u32 saturating cast: values above u32::MAX (~136 years) clamp
         // to u32::MAX, which is a safe, non-silent default for any real capture.
         config.flow_timeout_secs = cli.flow_timeout.min(u64::from(u32::MAX)) as u32;
         Some(TcpReassembler::new(config))
     } else {
         None
     };
 
-    let http_analyzer = if enable_http && !skip_reassembly {
+    let http_analyzer = if enable_http &&  /* ~ changed by cargo-mutants ~ */skip_reassembly {
         Some(HttpAnalyzer::new())
     } else {
         None
     };
     let tls_analyzer = if enable_tls && !skip_reassembly {
         Some(TlsAnalyzer::new())
     } else {
         None

---- mitre_flag_emits_tactic_headers_and_collapse_suffix stdout ----

thread 'mitre_flag_emits_tactic_headers_and_collapse_suffix' (177105471) panicked at tests/cli_integration_tests.rs:209:5:
BC-2.11.030 PC-2: `--mitre` must emit MITRE tactic section headers ('## '); got stdout:
WIRERUST TRIAGE REPORT
────────────────────────────────────────
  Packets: 16  Bytes: 929  Hosts: 2

PROTOCOLS
────────────────────────────────────────
  Tcp: 16

SERVICES
────────────────────────────────────────

---- mitre_no_collapse_emits_tactic_headers_without_collapse_suffix stdout ----

thread 'mitre_no_collapse_emits_tactic_headers_without_collapse_suffix' (177105472) panicked at tests/cli_integration_tests.rs:237:5:
BC-2.11.030 PC-3: `--mitre --no-collapse` must emit MITRE tactic headers ('## '); got stdout:
WIRERUST TRIAGE REPORT
────────────────────────────────────────
  Packets: 16  Bytes: 929  Hosts: 2

PROTOCOLS
────────────────────────────────────────
  Tcp: 16

SERVICES
────────────────────────────────────────

---- csv_flag_with_path_writes_csv_findings_table stdout ----

thread 'csv_flag_with_path_writes_csv_findings_table' (177105466) panicked at tests/cli_integration_tests.rs:106:5:
CSV must contain at least one finding row for the --all analysis of the fixture

failures:
    csv_flag_with_path_writes_csv_findings_table
    mitre_flag_emits_tactic_headers_and_collapse_suffix
    mitre_no_collapse_emits_tactic_headers_without_collapse_suffix

test result: FAILED. 6 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
