*** src/main.rs:205:38: replace && with || in run_analyze

*** mutation diff:
--- src/main.rs
+++ replace && with || in run_analyze
@@ -197,17 +197,17 @@
         None
     };
 
     let http_analyzer = if enable_http && !skip_reassembly {
         Some(HttpAnalyzer::new())
     } else {
         None
     };
-    let tls_analyzer = if enable_tls && !skip_reassembly {
+    let tls_analyzer = if enable_tls || /* ~ changed by cargo-mutants ~ */ !skip_reassembly {
         Some(TlsAnalyzer::new())
     } else {
         None
     };
     // BC-2.14.023 §P2: construct ModbusAnalyzer only when enabled AND reassembly is on.
     let modbus_analyzer: Option<ModbusAnalyzer> = if enable_modbus && !skip_reassembly {
         Some(ModbusAnalyzer::new(
             modbus_write_burst_threshold,

---- story_088::test_all_flag_enables_all_three_analyzers stdout ----

thread 'story_088::test_all_flag_enables_all_three_analyzers' (177108878) panicked at tests/main_story_088_tests.rs:95:14:
Unexpected stdout, failed (! var.contains(ANALYZER: TLS))
├── var as str: WIRERUST TRIAGE REPORT
│   ────────────────────────────────────────
│     Packets: 16  Bytes: 929  Hosts: 2
│   
│   PROTOCOLS
│   ────────────────────────────────────────
│     Tcp: 16
│   
│   SERVICES
│   ────────────────────────────────────────

failures:
    story_088::test_all_flag_enables_all_three_analyzers

test result: FAILED. 18 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
