*** src/main.rs:211:68: replace && with || in run_analyze

*** mutation diff:
--- src/main.rs
+++ replace && with || in run_analyze
@@ -203,17 +203,17 @@
         None
     };
     let tls_analyzer = if enable_tls && !skip_reassembly {
         Some(TlsAnalyzer::new())
     } else {
         None
     };
     // BC-2.14.023 §P2: construct ModbusAnalyzer only when enabled AND reassembly is on.
-    let modbus_analyzer: Option<ModbusAnalyzer> = if enable_modbus && !skip_reassembly {
+    let modbus_analyzer: Option<ModbusAnalyzer> = if enable_modbus || /* ~ changed by cargo-mutants ~ */ !skip_reassembly {
         Some(ModbusAnalyzer::new(
             modbus_write_burst_threshold,
             modbus_write_sustained_threshold,
         ))
     } else {
         None
     };
     // BC-2.15.021 / BC-2.15.017: construct Dnp3Analyzer only when enabled AND reassembly is on.

---- story_105::test_BC_2_14_023_modbus_with_no_reassemble_prints_warning stdout ----

thread 'story_105::test_BC_2_14_023_modbus_with_no_reassemble_prints_warning' (177114303) panicked at tests/bc_2_14_105_modbus_dispatch_tests.rs:555:17:
Modbus section must NOT appear when --no-reassemble is set (BC-2.14.023 EC-001)

---- story_105::test_BC_2_14_023_modbus_disabled_by_default stdout ----

thread 'story_105::test_BC_2_14_023_modbus_disabled_by_default' (177114301) panicked at tests/bc_2_14_105_modbus_dispatch_tests.rs:413:9:
Modbus section must NOT appear in output when --modbus is absent (BC-2.14.023 P1)

failures:
    story_105::test_BC_2_14_023_modbus_disabled_by_default
    story_105::test_BC_2_14_023_modbus_with_no_reassemble_prints_warning

test result: FAILED. 28 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.32s

*** result: Failure(101)
