*** src/main.rs:211:71: delete ! in run_analyze

*** mutation diff:
--- src/main.rs
+++ delete ! in run_analyze
@@ -203,17 +203,17 @@
         None
     };
     let tls_analyzer = if enable_tls && !skip_reassembly {
         Some(TlsAnalyzer::new())
     } else {
         None
     };
     // BC-2.14.023 §P2: construct ModbusAnalyzer only when enabled AND reassembly is on.
-    let modbus_analyzer: Option<ModbusAnalyzer> = if enable_modbus && !skip_reassembly {
+    let modbus_analyzer: Option<ModbusAnalyzer> = if enable_modbus &&  /* ~ changed by cargo-mutants ~ */skip_reassembly {
         Some(ModbusAnalyzer::new(
             modbus_write_burst_threshold,
             modbus_write_sustained_threshold,
         ))
     } else {
         None
     };
     // BC-2.15.021 / BC-2.15.017: construct Dnp3Analyzer only when enabled AND reassembly is on.

---- story_105::test_BC_2_14_023_modbus_flag_enables_analyzer_empty_pcap stdout ----

thread 'story_105::test_BC_2_14_023_modbus_flag_enables_analyzer_empty_pcap' (177116449) panicked at tests/bc_2_14_105_modbus_dispatch_tests.rs:463:9:
Modbus section MUST appear in output when --modbus is provided (BC-2.14.023 P2). Analyzers found: ["TCP Reassembly"]

---- story_105::test_BC_2_14_023_modbus_with_no_reassemble_prints_warning stdout ----

thread 'story_105::test_BC_2_14_023_modbus_with_no_reassemble_prints_warning' (177116450) panicked at tests/bc_2_14_105_modbus_dispatch_tests.rs:555:17:
Modbus section must NOT appear when --no-reassemble is set (BC-2.14.023 EC-001)

---- story_105::test_BC_2_14_023_modbus_alone_triggers_reassembly stdout ----

thread 'story_105::test_BC_2_14_023_modbus_alone_triggers_reassembly' (177116447) panicked at tests/bc_2_14_105_modbus_dispatch_tests.rs:716:9:
Modbus analyzer summary MUST appear when --modbus alone triggers reassembly (BC-2.14.023 P4, AC-010). Got analyzers: ["TCP Reassembly"]

failures:
    story_105::test_BC_2_14_023_all_flag_enables_modbus
    story_105::test_BC_2_14_023_modbus_alone_triggers_reassembly
    story_105::test_BC_2_14_023_modbus_flag_enables_analyzer_empty_pcap
    story_105::test_BC_2_14_023_modbus_with_no_reassemble_prints_warning

test result: FAILED. 26 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.30s

*** result: Failure(101)
