*** src/main.rs:255:43: replace && with || in run_analyze

*** mutation diff:
--- src/main.rs
+++ replace && with || in run_analyze
@@ -247,17 +247,17 @@
                 pb.set_style(ProgressStyle::with_template(
                     "[{elapsed_precise}] {bar:40} {pos}/{len} packets",
                 )?);
 
                 for raw in &source.packets {
                     match decode_packet(&raw.data, source.datalink) {
                         Ok(DecodedFrame::Ip(parsed)) => {
                             summary.ingest(&parsed);
-                            if enable_dns && dns_analyzer.can_decode(&parsed) {
+                            if enable_dns || /* ~ changed by cargo-mutants ~ */ dns_analyzer.can_decode(&parsed) {
                                 let findings = dns_analyzer.analyze(&parsed);
                                 all_findings.extend(findings);
                             }
                             if let Some(ref mut reasm) = reassembler {
                                 reasm.process_packet(&parsed, raw.timestamp_secs, &mut dispatcher);
                             }
                         }
                         // STORY-113: ArpAnalyzer wiring (BC-2.16.011; AC-015/AC-016).

---- story_088::test_dns_analyzer_constructed_without_reassembly stdout ----

thread 'story_088::test_dns_analyzer_constructed_without_reassembly' (177139900) panicked at tests/main_story_088_tests.rs:287:14:
Unexpected stdout, failed var.contains(dns_queries: 6)
├── var: WIRERUST TRIAGE REPORT
│   ────────────────────────────────────────
│     Packets: 58  Bytes: 7542  Hosts: 3
│     Skipped: 69 packets (decode errors)
│   
│   PROTOCOLS
│   ────────────────────────────────────────
│     Tcp: 52
│     Udp: 6
│

failures:
    story_088::test_dns_analyzer_constructed_without_reassembly

test result: FAILED. 18 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
