*** src/main.rs:274:39: replace match guard e.to_string().contains("Non-Ethernet/IPv4 ARP frame") with true in run_analyze

*** mutation diff:
--- src/main.rs
+++ replace match guard e.to_string().contains("Non-Ethernet/IPv4 ARP frame") with true in run_analyze
@@ -266,17 +266,17 @@
                         // process_arp is called only when --arp is active (enable_arp gate).
                         Ok(DecodedFrame::Arp(arp_frame)) => {
                             if enable_arp {
                                 let ts = raw.timestamp_secs;
                                 let findings = arp_analyzer.process_arp(&arp_frame, ts);
                                 all_findings.extend(findings);
                             }
                         }
-                        Err(ref e) if e.to_string().contains("Non-Ethernet/IPv4 ARP frame") => {
+                        Err(ref e) if true /* ~ changed by cargo-mutants ~ */ => {
                             // STORY-113: D11 malformed ARP notification (BC-2.16.009 PC3/PC4).
                             // malformed_frames increments unconditionally (BC-2.16.009 PC4).
                             // When --arp active: record_malformed emits D11 Finding and
                             // increments both malformed_frames and malformed_findings (AC-012).
                             // When --arp absent: only malformed_frames increments; no finding
                             // emitted and malformed_findings unchanged (BC-2.16.009 PC4, ADR-008
                             // Decision 7, BC-2.16.010 key 11).
                             if enable_arp {

---- story_089::test_first_decode_error_warning_printed stdout ----

thread 'story_089::test_first_decode_error_warning_printed' (177130985) panicked at tests/main_story_089_tests.rs:110:14:
Unexpected stderr, failed var.contains(Warning: failed to decode packet)
├── var: 
└── var as str: 

command=`"/private/var/folders/p5/tjcpsj_90sd8b2t321cqpf600000gn/T/cargo-mutants-wirerust-ePVJFG.tmp/target/debug/wirerust" "analyze" "tests/fixtures/dns-remoteshell.pcap" "--dns"`
code=0
stdout=```
\x1b\x1bWIRERUST TRIAGE REPORT\x1b\x1b
────────────────────────────────────────
  Packets: 58  Bytes: 7542  Hosts: 3

---- story_089::test_EC_005_all_packets_fail_one_warning_skipped_count_accurate stdout ----

thread 'story_089::test_EC_005_all_packets_fail_one_warning_skipped_count_accurate' (177130983) panicked at tests/main_story_089_tests.rs:760:9:
assertion `left == right` failed: warning must appear exactly once; found 0 times. stderr: 
  left: 0
 right: 1

---- story_089::test_decode_error_warning_printed_at_most_once stdout ----

thread 'story_089::test_decode_error_warning_printed_at_most_once' (177130984) panicked at tests/main_story_089_tests.rs:241:9:
assertion `left == right` failed: warning must appear exactly once; found 0 times. stderr: 
  left: 0
 right: 1

failures:
    story_089::test_EC_005_all_packets_fail_one_warning_skipped_count_accurate
    story_089::test_decode_error_warning_printed_at_most_once
    story_089::test_first_decode_error_warning_printed
    story_089::test_skipped_packets_equals_total_decode_errors
    story_089::test_subsequent_decode_errors_silent

test result: FAILED. 20 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
