*** src/main.rs:289:52: replace == with != in run_analyze

*** mutation diff:
--- src/main.rs
+++ replace == with != in run_analyze
@@ -281,17 +281,17 @@
                             // Decision 7, BC-2.16.010 key 11).
                             if enable_arp {
                                 all_findings.extend(arp_analyzer.record_malformed(raw.data.len()));
                             } else {
                                 arp_analyzer.malformed_frames += 1;
                             }
                         }
                         Err(e) => {
-                            if total_decode_errors == 0 {
+                            if total_decode_errors != /* ~ changed by cargo-mutants ~ */ 0 {
                                 eprintln!(
                                     "Warning: failed to decode packet ({e}). Further errors counted silently."
                                 );
                             }
                             total_decode_errors += 1;
                         }
                     }
                     pb.inc(1);

---- story_089::test_EC_005_all_packets_fail_one_warning_skipped_count_accurate stdout ----

thread 'story_089::test_EC_005_all_packets_fail_one_warning_skipped_count_accurate' (177154383) panicked at tests/main_story_089_tests.rs:760:9:
assertion `left == right` failed: warning must appear exactly once; found 68 times. stderr: Warning: failed to decode packet (No IP layer found). Further errors counted silently.
Warning: failed to decode packet (No IP layer found). Further errors counted silently.
Warning: failed to decode packet (No IP layer found). Further errors counted silently.
Warning: failed to decode packet (No IP layer found). Further errors counted silently.
Warning: failed to decode packet (No IP layer found). Further errors counted silently.
Warning: failed to decode packet (No IP layer found). Further errors counted silently.
Warning: failed to decode packet (No IP layer fo

---- story_089::test_decode_error_warning_printed_at_most_once stdout ----

thread 'story_089::test_decode_error_warning_printed_at_most_once' (177154384) panicked at tests/main_story_089_tests.rs:241:9:
assertion `left == right` failed: warning must appear exactly once; found 68 times. stderr: Warning: failed to decode packet (No IP layer found). Further errors counted silently.
Warning: failed to decode packet (No IP layer found). Further errors counted silently.
Warning: failed to decode packet (No IP layer found). Further errors counted silently.
Warning: failed to decode packet (No IP layer found). Further errors counted silently.
Warning: failed to decode packet (No IP layer found). Further errors counted silently.
Warning: failed to decode packet (No IP layer found). Further errors counted silently.
Warning: failed to decode packet (No IP layer found). Further errors counted silen

---- story_089::test_subsequent_decode_errors_silent stdout ----

thread 'story_089::test_subsequent_decode_errors_silent' (177154453) panicked at tests/main_story_089_tests.rs:154:9:
assertion `left == right` failed: expected exactly 1 warning line; got 68. stderr: Warning: failed to decode packet (No IP layer found). Further errors counted silently.
Warning: failed to decode packet (No IP layer found). Further errors counted silently.
Warning: failed to decode packet (No IP layer found). Further errors counted silently.
Warning: failed to decode packet (No IP layer found). Further errors counted silently.
Warning: failed to decode packet (No IP layer found). Further errors counted silently.
Warning: failed to decode packet (No IP layer found). Further errors counted silently.
Warning: failed to decode packet (No IP layer found). Further errors counted silently.
Warning: failed to decod

failures:
    story_089::test_EC_005_all_packets_fail_one_warning_skipped_count_accurate
    story_089::test_decode_error_warning_printed_at_most_once
    story_089::test_subsequent_decode_errors_silent

test result: FAILED. 22 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
