*** src/main.rs:294:49: replace += with -= in run_analyze

*** mutation diff:
--- src/main.rs
+++ replace += with -= in run_analyze
@@ -286,17 +286,17 @@
                             }
                         }
                         Err(e) => {
                             if total_decode_errors == 0 {
                                 eprintln!(
                                     "Warning: failed to decode packet ({e}). Further errors counted silently."
                                 );
                             }
-                            total_decode_errors += 1;
+                            total_decode_errors -= /* ~ changed by cargo-mutants ~ */ 1;
                         }
                     }
                     pb.inc(1);
                 }
                 pb.finish_and_clear();
             }
         }
         Ok(())

---- story_088::test_dns_analyzer_constructed_without_reassembly stdout ----

thread 'story_088::test_dns_analyzer_constructed_without_reassembly' (177157852) panicked at tests/main_story_088_tests.rs:281:14:
Unexpected failure.
code=101
stderr=``````
Warning: failed to decode packet (No IP layer found). Further errors counted silently.

thread \'main\' (177157864) panicked at src/main.rs:294:29:
attempt to subtract with overflow
```
```
command=`"/private/var/folders/p5/tjcpsj_90sd8b2t321cqpf600000gn/T/cargo-mutants-wirerust-ePVJFG.tmp/target/debug/wirerust" "analyze" "tests/fixtures/dns-remoteshell.pcap" "--dns" "--no-reassemble"`
code=101

failures:
    story_088::test_dns_analyzer_constructed_without_reassembly

test result: FAILED. 18 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
