*** src/main.rs:294:49: replace += with *= in run_analyze

*** mutation diff:
--- src/main.rs
+++ replace += with *= in run_analyze
@@ -286,17 +286,17 @@
                             }
                         }
                         Err(e) => {
                             if total_decode_errors == 0 {
                                 eprintln!(
                                     "Warning: failed to decode packet ({e}). Further errors counted silently."
                                 );
                             }
-                            total_decode_errors += 1;
+                            total_decode_errors *= /* ~ changed by cargo-mutants ~ */ 1;
                         }
                     }
                     pb.inc(1);
                 }
                 pb.finish_and_clear();
             }
         }
         Ok(())

---- story_089::test_decode_error_warning_printed_at_most_once stdout ----

thread 'story_089::test_decode_error_warning_printed_at_most_once' (177161374) panicked at tests/main_story_089_tests.rs:241:9:
assertion `left == right` failed: warning must appear exactly once; found 69 times. stderr: Warning: failed to decode packet (No IP layer found). Further errors counted silently.
Warning: failed to decode packet (No IP layer found). Further errors counted silently.
Warning: failed to decode packet (No IP layer found). Further errors counted silently.
Warning: failed to decode packet (No IP layer found). Further errors counted silently.
Warning: failed to decode packet (No IP layer found). Further errors counted silently.
Warning: failed to decode packet (No IP layer found). Further errors counted silently.
Warning: failed to decode packet (No IP layer found). Further errors counted silen

---- story_089::test_EC_005_all_packets_fail_one_warning_skipped_count_accurate stdout ----

thread 'story_089::test_EC_005_all_packets_fail_one_warning_skipped_count_accurate' (177161373) panicked at tests/main_story_089_tests.rs:760:9:
assertion `left == right` failed: warning must appear exactly once; found 69 times. stderr: Warning: failed to decode packet (No IP layer found). Further errors counted silently.
Warning: failed to decode packet (No IP layer found). Further errors counted silently.
Warning: failed to decode packet (No IP layer found). Further errors counted silently.
Warning: failed to decode packet (No IP layer found). Further errors counted silently.
Warning: failed to decode packet (No IP layer found). Further errors counted silently.
Warning: failed to decode packet (No IP layer found). Further errors counted silently.
Warning: failed to decode packet (No IP layer fo

---- story_089::test_skipped_packets_equals_total_decode_errors stdout ----

thread 'story_089::test_skipped_packets_equals_total_decode_errors' (177161438) panicked at tests/main_story_089_tests.rs:197:14:
Unexpected stdout, failed var.contains("skipped_packets": 69)
├── var: {
│     "analyzers": [
│       {
│         "analyzer_name": "DNS",
│         "detail": {
│           "dns_queries": 6,
│           "dns_responses": 12
│         },
│         "packets_analyzed": 18
│       }

failures:
    story_089::test_EC_005_all_packets_fail_one_warning_skipped_count_accurate
    story_089::test_decode_error_warning_printed_at_most_once
    story_089::test_skipped_packets_equals_total_decode_errors
    story_089::test_subsequent_decode_errors_silent

test result: FAILED. 21 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
