*** src/main.rs:364:9: delete match arm Some(OutputFormat::Json) in run_analyze

*** mutation diff:
--- src/main.rs
+++ delete match arm Some(OutputFormat::Json) in run_analyze
@@ -356,20 +356,17 @@
     // summarize() and push to analyzer_summaries only when --arp is active.
     // Mirrors the Modbus/DNP3 pattern per BC-2.16.010 Invariant 4.
     if enable_arp {
         analyzer_summaries.push(arp_analyzer.summarize());
     }
 
     let resolved_format = resolve_format(cli);
     let output = match resolved_format {
-        Some(OutputFormat::Json) => {
-            let reporter = JsonReporter;
-            reporter.render(&summary, &all_findings, &analyzer_summaries)
-        }
+         /* ~ changed by cargo-mutants ~ */
         Some(OutputFormat::Csv) => {
             let reporter = CsvReporter;
             reporter.render(&summary, &all_findings, &analyzer_summaries)
         }
         _ => {
             let reporter = TerminalReporter {
                 use_color,
                 // `analyze` does not expose a per-host breakdown flag —

---- story_105::test_BC_2_14_023_modbus_with_no_reassemble_prints_warning stdout ----

thread 'story_105::test_BC_2_14_023_modbus_with_no_reassemble_prints_warning' (177163485) panicked at tests/bc_2_14_105_modbus_dispatch_tests.rs:550:76:
valid JSON: Error("expected value", line: 1, column: 1)

---- story_105::test_BC_2_14_023_modbus_flag_enables_analyzer_empty_pcap stdout ----

thread 'story_105::test_BC_2_14_023_modbus_flag_enables_analyzer_empty_pcap' (177163484) panicked at tests/bc_2_14_105_modbus_dispatch_tests.rs:453:72:
valid JSON: Error("expected value", line: 1, column: 1)

---- story_105::test_BC_2_14_023_modbus_alone_triggers_reassembly stdout ----

thread 'story_105::test_BC_2_14_023_modbus_alone_triggers_reassembly' (177163482) panicked at tests/bc_2_14_105_modbus_dispatch_tests.rs:706:72:
valid JSON: Error("expected value", line: 1, column: 1)

failures:
    story_105::test_BC_2_14_023_all_flag_enables_modbus
    story_105::test_BC_2_14_023_modbus_alone_triggers_reassembly
    story_105::test_BC_2_14_023_modbus_disabled_by_default
    story_105::test_BC_2_14_023_modbus_flag_enables_analyzer_empty_pcap
    story_105::test_BC_2_14_023_modbus_with_no_reassemble_prints_warning

test result: FAILED. 25 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.35s

*** result: Failure(101)
