*** src/main.rs:368:9: delete match arm Some(OutputFormat::Csv) in run_analyze

*** mutation diff:
--- src/main.rs
+++ delete match arm Some(OutputFormat::Csv) in run_analyze
@@ -360,20 +360,17 @@
     }
 
     let resolved_format = resolve_format(cli);
     let output = match resolved_format {
         Some(OutputFormat::Json) => {
             let reporter = JsonReporter;
             reporter.render(&summary, &all_findings, &analyzer_summaries)
         }
-        Some(OutputFormat::Csv) => {
-            let reporter = CsvReporter;
-            reporter.render(&summary, &all_findings, &analyzer_summaries)
-        }
+         /* ~ changed by cargo-mutants ~ */
         _ => {
             let reporter = TerminalReporter {
                 use_color,
                 // `analyze` does not expose a per-host breakdown flag —
                 // that is `summary`-subcommand-only (LESSON-P1.03).
                 show_hosts_breakdown: false,
                 // BC-2.11.028 / BC-2.11.030: orthogonal 2-if struct wiring (STORY-119/B CLI flip).
                 // --mitre alone (show_mitre_grouping=true, collapse_findings=true) → {Grouped, Collapsed}.

---- csv_flag_without_path_writes_csv_to_stdout stdout ----

thread 'csv_flag_without_path_writes_csv_to_stdout' (177166094) panicked at tests/cli_integration_tests.rs:126:5:
stdout must begin with the CSV header, got: "\u{1b}\u{1b}WIRERUST TRIAGE REPORT\u{1b}\u{1b}\n───────"

---- output_format_csv_emits_csv stdout ----

thread 'output_format_csv_emits_csv' (177166100) panicked at tests/cli_integration_tests.rs:145:5:
--output-format csv must produce CSV output

---- csv_flag_with_path_writes_csv_findings_table stdout ----

thread 'csv_flag_with_path_writes_csv_findings_table' (177166093) panicked at tests/cli_integration_tests.rs:99:5:
assertion `left == right` failed: CSV must start with the fixed header row
  left: Some("\u{1b}\u{1b}WIRERUST TRIAGE REPORT\u{1b}\u{1b}")
 right: Some("category,verdict,confidence,summary,evidence,mitre_techniques,source_ip,direction,timestamp")

failures:
    csv_flag_with_path_writes_csv_findings_table
    csv_flag_without_path_writes_csv_to_stdout
    output_format_csv_emits_csv

test result: FAILED. 6 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
