*** src/main.rs:438:9: delete match arm Some(OutputFormat::Json) in run_summary

*** mutation diff:
--- src/main.rs
+++ delete match arm Some(OutputFormat::Json) in run_summary
@@ -430,20 +430,17 @@
                 }
             }
         }
     }
     summary.skipped_packets = total_decode_errors;
 
     let resolved_format = resolve_format(cli);
     let output = match resolved_format {
-        Some(OutputFormat::Json) => {
-            let reporter = JsonReporter;
-            reporter.render(&summary, &[], &[])
-        }
+         /* ~ changed by cargo-mutants ~ */
         Some(OutputFormat::Csv) => {
             let reporter = CsvReporter;
             reporter.render(&summary, &[], &[])
         }
         _ => {
             let reporter = TerminalReporter {
                 use_color,
                 show_hosts_breakdown,

---- story_089::test_run_summary_decode_error_warning_once stdout ----

thread 'story_089::test_run_summary_decode_error_warning_once' (177182395) panicked at tests/main_story_089_tests.rs:828:9:
run_summary: expected skipped_packets 69 in JSON output (STORY-112: 4 ARP frames now decode successfully, was 73 in STORY-111); stdout: WIRERUST TRIAGE REPORT
────────────────────────────────────────
  Packets: 58  Bytes: 7542  Hosts: 3
  Skipped: 69 packets (decode errors)

PROTOCOLS
────────────────────────────────────────
  Tcp: 52
  Udp: 6

SERVICES

---- story_089::test_BC_2_12_014_single_error_fixture_first_error_fires_warning_run_summary stdout ----

thread 'story_089::test_BC_2_12_014_single_error_fixture_first_error_fires_warning_run_summary' (177182384) panicked at tests/main_story_089_tests.rs:1077:9:
ADV-P04-MED-001 run_summary (STORY-112): ARP frame decodes successfully, expected skipped_packets=0 in JSON; stdout: WIRERUST TRIAGE REPORT
────────────────────────────────────────
  Packets: 1  Bytes: 47  Hosts: 2

PROTOCOLS
────────────────────────────────────────
  Udp: 1

SERVICES
────────────────────────────────────────
  DNS: 1

---- story_089::test_run_summary_resolve_format_json stdout ----

thread 'story_089::test_run_summary_resolve_format_json' (177182449) panicked at tests/main_story_089_tests.rs:860:20:
end byte index 50 is not a char boundary; it is inside '─' (bytes 48..51 of string)

failures:
    story_089::test_BC_2_12_014_single_error_fixture_first_error_fires_warning_run_summary
    story_089::test_run_summary_decode_error_warning_once
    story_089::test_run_summary_resolve_format_fallback_to_terminal
    story_089::test_run_summary_resolve_format_json
    story_089::test_run_summary_write_output_to_file

test result: FAILED. 20 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
