*** src/main.rs:442:9: delete match arm Some(OutputFormat::Csv) in run_summary

*** mutation diff:
--- src/main.rs
+++ delete match arm Some(OutputFormat::Csv) in run_summary
@@ -434,20 +434,17 @@
     summary.skipped_packets = total_decode_errors;
 
     let resolved_format = resolve_format(cli);
     let output = match resolved_format {
         Some(OutputFormat::Json) => {
             let reporter = JsonReporter;
             reporter.render(&summary, &[], &[])
         }
-        Some(OutputFormat::Csv) => {
-            let reporter = CsvReporter;
-            reporter.render(&summary, &[], &[])
-        }
+         /* ~ changed by cargo-mutants ~ */
         _ => {
             let reporter = TerminalReporter {
                 use_color,
                 show_hosts_breakdown,
                 // BC-2.11.028 invariant 4: render field is inert for run_summary — no FINDINGS section.
                 render: FindingsRender {
                     grouping: Grouping::Flat,
                     collapse: Collapse::Collapsed,

---- summary_subcommand_also_supports_csv stdout ----

thread 'summary_subcommand_also_supports_csv' (177184998) panicked at tests/cli_integration_tests.rs:164:5:
summary --csv must produce the CSV header

failures:
    summary_subcommand_also_supports_csv

test result: FAILED. 8 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
