*** src/main.rs:44:5: replace main -> Result<()> with Ok(())

*** mutation diff:
--- src/main.rs
+++ replace main -> Result<()> with Ok(())
@@ -36,63 +36,17 @@
 use wirerust::reassembly::{ReassemblyConfig, TcpReassembler};
 use wirerust::reporter::Reporter;
 use wirerust::reporter::csv::CsvReporter;
 use wirerust::reporter::json::JsonReporter;
 use wirerust::reporter::terminal::{Collapse, FindingsRender, Grouping, TerminalReporter};
 use wirerust::summary::Summary;
 
 fn main() -> Result<()> {
-    let cli = Cli::parse();
-
-    let use_color = !cli.no_color && std::env::var("NO_COLOR").is_err();
-
-    match &cli.command {
-        Commands::Analyze {
-            targets,
-            dns,
-            http,
-            tls,
-            all,
-            mitre,
-            no_collapse,
-            modbus,
-            modbus_write_burst_threshold,
-            modbus_write_sustained_threshold,
-            dnp3,
-            dnp3_direct_operate_threshold,
-            arp,
-            arp_spoof_threshold,
-            arp_storm_rate,
-        } => {
-            run_analyze(
-                targets,
-                *dns || *all,
-                *http || *all,
-                *tls || *all,
-                *modbus || *all,
-                *modbus_write_burst_threshold,
-                *modbus_write_sustained_threshold,
-                *dnp3 || *all,
-                *dnp3_direct_operate_threshold,
-                *arp || *all,
-                *arp_spoof_threshold,
-                *arp_storm_rate,
-                *mitre,
-                collapse_findings_from_flag(*no_collapse),
-                use_color,
-                &cli,
-            )?;
-        }
-        Commands::Summary { targets, hosts } => {
-            run_summary(targets, *hosts, use_color, &cli)?;
-        }
-    }
-
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[allow(clippy::too_many_arguments)]
 fn run_analyze(
     targets: &[std::path::PathBuf],
     enable_dns: bool,
     enable_http: bool,
     enable_tls: bool,

---- story_105::test_BC_2_14_024_burst_threshold_zero_rejected stdout ----

thread 'story_105::test_BC_2_14_024_burst_threshold_zero_rejected' (177015795) panicked at tests/bc_2_14_105_modbus_dispatch_tests.rs:587:9:
exit code must be non-zero when --modbus-write-burst-threshold 0 (BC-2.14.024 P3a)

---- story_105::test_BC_2_14_023_modbus_flag_enables_analyzer_empty_pcap stdout ----

thread 'story_105::test_BC_2_14_023_modbus_flag_enables_analyzer_empty_pcap' (177015793) panicked at tests/bc_2_14_105_modbus_dispatch_tests.rs:452:53:
output written: Os { code: 2, kind: NotFound, message: "No such file or directory" }

---- story_105::test_BC_2_14_023_modbus_with_no_reassemble_prints_warning stdout ----

thread 'story_105::test_BC_2_14_023_modbus_with_no_reassemble_prints_warning' (177015794) panicked at tests/bc_2_14_105_modbus_dispatch_tests.rs:542:9:
stderr must contain the reassembly warning (BC-2.14.023 EC-001), got: ""

failures:
    story_105::test_BC_2_14_023_all_flag_enables_modbus
    story_105::test_BC_2_14_023_modbus_alone_triggers_reassembly
    story_105::test_BC_2_14_023_modbus_disabled_by_default
    story_105::test_BC_2_14_023_modbus_flag_enables_analyzer_empty_pcap
    story_105::test_BC_2_14_023_modbus_with_no_reassemble_prints_warning
    story_105::test_BC_2_14_024_burst_threshold_zero_rejected
    story_105::test_BC_2_14_024_sustained_threshold_zero_rejected

test result: FAILED. 23 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.25s

*** result: Failure(101)
