*** src/main.rs:46:21: delete ! in main

*** mutation diff:
--- src/main.rs
+++ delete ! in main
@@ -38,17 +38,17 @@
 use wirerust::reporter::csv::CsvReporter;
 use wirerust::reporter::json::JsonReporter;
 use wirerust::reporter::terminal::{Collapse, FindingsRender, Grouping, TerminalReporter};
 use wirerust::summary::Summary;
 
 fn main() -> Result<()> {
     let cli = Cli::parse();
 
-    let use_color = !cli.no_color && std::env::var("NO_COLOR").is_err();
+    let use_color =  /* ~ changed by cargo-mutants ~ */cli.no_color && std::env::var("NO_COLOR").is_err();
 
     match &cli.command {
         Commands::Analyze {
             targets,
             dns,
             http,
             tls,
             all,

---- story_088::test_progress_bar_does_not_appear_in_output stdout ----

thread 'story_088::test_progress_bar_does_not_appear_in_output' (177018986) panicked at tests/main_story_088_tests.rs:573:14:
Unexpected stdout, failed (! var.contains())
├── var as str: WIRERUST TRIAGE REPORT
│   ────────────────────────────────────────
│     Packets: 16  Bytes: 929  Hosts: 2
│   
│   PROTOCOLS
│   ────────────────────────────────────────
│     Tcp: 16
│   
│   SERVICES
│   ────────────────────────────────────────

---- story_088::test_run_summary_has_no_progress_bar stdout ----

thread 'story_088::test_run_summary_has_no_progress_bar' (177019046) panicked at tests/main_story_088_tests.rs:615:14:
Unexpected stdout, failed (! var.contains())
├── var as str: WIRERUST TRIAGE REPORT
│   ────────────────────────────────────────
│     Packets: 16  Bytes: 929  Hosts: 2
│   
│   PROTOCOLS
│   ────────────────────────────────────────
│     Tcp: 16
│   
│   SERVICES
│   ────────────────────────────────────────

---- story_088::test_use_color_true_when_no_flags_set stdout ----

thread 'story_088::test_use_color_true_when_no_flags_set' (177019047) panicked at tests/main_story_088_tests.rs:346:14:
Unexpected stdout, failed var.contains()
├── var: WIRERUST TRIAGE REPORT
│   ────────────────────────────────────────
│     Packets: 16  Bytes: 929  Hosts: 2
│   
│   PROTOCOLS
│   ────────────────────────────────────────
│     Tcp: 16
│   
│   SERVICES
│   ────────────────────────────────────────

failures:
    story_088::test_progress_bar_does_not_appear_in_output
    story_088::test_run_summary_has_no_progress_bar
    story_088::test_use_color_true_when_no_flags_set

test result: FAILED. 16 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
