*** src/main.rs:46:35: replace && with || in main

*** mutation diff:
--- src/main.rs
+++ replace && with || in main
@@ -38,17 +38,17 @@
 use wirerust::reporter::csv::CsvReporter;
 use wirerust::reporter::json::JsonReporter;
 use wirerust::reporter::terminal::{Collapse, FindingsRender, Grouping, TerminalReporter};
 use wirerust::summary::Summary;
 
 fn main() -> Result<()> {
     let cli = Cli::parse();
 
-    let use_color = !cli.no_color && std::env::var("NO_COLOR").is_err();
+    let use_color = !cli.no_color || /* ~ changed by cargo-mutants ~ */ std::env::var("NO_COLOR").is_err();
 
     match &cli.command {
         Commands::Analyze {
             targets,
             dns,
             http,
             tls,
             all,

---- story_088::test_EC_004_no_color_empty_value_disables_color stdout ----

thread 'story_088::test_EC_004_no_color_empty_value_disables_color' (177017330) panicked at tests/main_story_088_tests.rs:720:14:
Unexpected stdout, failed (! var.contains())
├── var as str: WIRERUST TRIAGE REPORT
│   ────────────────────────────────────────
│     Packets: 16  Bytes: 929  Hosts: 2
│   
│   PROTOCOLS
│   ────────────────────────────────────────
│     Tcp: 16
│   
│   SERVICES
│   ────────────────────────────────────────

---- story_088::test_no_color_env_var_disables_color stdout ----

thread 'story_088::test_no_color_env_var_disables_color' (177017336) panicked at tests/main_story_088_tests.rs:318:14:
Unexpected stdout, failed (! var.contains())
├── var as str: WIRERUST TRIAGE REPORT
│   ────────────────────────────────────────
│     Packets: 16  Bytes: 929  Hosts: 2
│   
│   PROTOCOLS
│   ────────────────────────────────────────
│     Tcp: 16
│   
│   SERVICES
│   ────────────────────────────────────────

---- story_088::test_progress_bar_does_not_appear_in_output stdout ----

thread 'story_088::test_progress_bar_does_not_appear_in_output' (177017339) panicked at tests/main_story_088_tests.rs:573:14:
Unexpected stdout, failed (! var.contains())
├── var as str: WIRERUST TRIAGE REPORT
│   ────────────────────────────────────────
│     Packets: 16  Bytes: 929  Hosts: 2
│   
│   PROTOCOLS
│   ────────────────────────────────────────
│     Tcp: 16
│   
│   SERVICES
│   ────────────────────────────────────────

failures:
    story_088::test_EC_004_no_color_empty_value_disables_color
    story_088::test_no_color_env_var_disables_color
    story_088::test_progress_bar_does_not_appear_in_output
    story_088::test_run_summary_has_no_progress_bar

test result: FAILED. 15 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
