*** src/main.rs:473:5: replace resolve_format -> Option<OutputFormat> with None

*** mutation diff:
--- src/main.rs
+++ replace resolve_format -> Option<OutputFormat> with None
@@ -465,23 +465,17 @@
 ///
 /// Precedence (highest to lowest):
 /// 1. `--json [<FILE>]` forces `OutputFormat::Json`.
 /// 2. `--csv [<FILE>]` forces `OutputFormat::Csv`. (`--json` and `--csv`
 ///    are mutually exclusive — clap rejects the combination.)
 /// 3. `--output-format <fmt>` is honored as-is.
 /// 4. Default (terminal table) when no flag is given.
 fn resolve_format(cli: &Cli) -> Option<OutputFormat> {
-    if cli.json.is_some() {
-        Some(OutputFormat::Json)
-    } else if cli.csv.is_some() {
-        Some(OutputFormat::Csv)
-    } else {
-        cli.output_format
-    }
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 /// Write rendered output to a file (if `--json <FILE>` or `--csv <FILE>`
 /// was given with a path) or to stdout otherwise.
 ///
 /// `--json` and `--csv` are mutually exclusive (enforced by clap), so at
 /// most one of the file-path arms can be active.
 fn write_output(output: &str, cli: &Cli) -> Result<()> {

---- story_105::test_BC_2_14_023_modbus_with_no_reassemble_prints_warning stdout ----

thread 'story_105::test_BC_2_14_023_modbus_with_no_reassemble_prints_warning' (177187075) panicked at tests/bc_2_14_105_modbus_dispatch_tests.rs:550:76:
valid JSON: Error("expected value", line: 1, column: 1)

---- story_105::test_BC_2_14_023_modbus_alone_triggers_reassembly stdout ----

thread 'story_105::test_BC_2_14_023_modbus_alone_triggers_reassembly' (177187072) panicked at tests/bc_2_14_105_modbus_dispatch_tests.rs:706:72:
valid JSON: Error("expected value", line: 1, column: 1)

---- story_105::test_BC_2_14_023_modbus_disabled_by_default stdout ----

thread 'story_105::test_BC_2_14_023_modbus_disabled_by_default' (177187073) panicked at tests/bc_2_14_105_modbus_dispatch_tests.rs:403:72:
valid JSON: Error("expected value", line: 1, column: 1)

failures:
    story_105::test_BC_2_14_023_all_flag_enables_modbus
    story_105::test_BC_2_14_023_modbus_alone_triggers_reassembly
    story_105::test_BC_2_14_023_modbus_disabled_by_default
    story_105::test_BC_2_14_023_modbus_flag_enables_analyzer_empty_pcap
    story_105::test_BC_2_14_023_modbus_with_no_reassemble_prints_warning

test result: FAILED. 25 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.32s

*** result: Failure(101)
