*** src/main.rs:488:5: replace write_output -> Result<()> with Ok(())

*** mutation diff:
--- src/main.rs
+++ replace write_output -> Result<()> with Ok(())
@@ -480,26 +480,17 @@
 }
 
 /// Write rendered output to a file (if `--json <FILE>` or `--csv <FILE>`
 /// was given with a path) or to stdout otherwise.
 ///
 /// `--json` and `--csv` are mutually exclusive (enforced by clap), so at
 /// most one of the file-path arms can be active.
 fn write_output(output: &str, cli: &Cli) -> Result<()> {
-    match (&cli.json, &cli.csv) {
-        (Some(Some(path)), _) => std::fs::write(path, output)
-            .with_context(|| format!("Failed to write JSON output to {}", path.display())),
-        (_, Some(Some(path))) => std::fs::write(path, output)
-            .with_context(|| format!("Failed to write CSV output to {}", path.display())),
-        _ => {
-            println!("{output}");
-            Ok(())
-        }
-    }
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Maps the `--no-collapse` opt-out flag to the `TerminalReporter` `collapse_findings`
 /// field (default-on per BC-2.11.028).
 ///
 /// When the flag is absent (`no_collapse = false`), collapse is ON (`true`).
 /// When `--no-collapse` is passed (`no_collapse = true`), collapse is OFF (`false`).
 fn collapse_findings_from_flag(no_collapse: bool) -> bool {

---- story_105::test_BC_2_14_023_modbus_alone_triggers_reassembly stdout ----

thread 'story_105::test_BC_2_14_023_modbus_alone_triggers_reassembly' (177189608) panicked at tests/bc_2_14_105_modbus_dispatch_tests.rs:705:53:
output written: Os { code: 2, kind: NotFound, message: "No such file or directory" }

---- story_105::test_BC_2_14_023_modbus_flag_enables_analyzer_empty_pcap stdout ----

thread 'story_105::test_BC_2_14_023_modbus_flag_enables_analyzer_empty_pcap' (177189610) panicked at tests/bc_2_14_105_modbus_dispatch_tests.rs:452:53:
output written: Os { code: 2, kind: NotFound, message: "No such file or directory" }

---- story_105::test_BC_2_14_023_modbus_disabled_by_default stdout ----

thread 'story_105::test_BC_2_14_023_modbus_disabled_by_default' (177189609) panicked at tests/bc_2_14_105_modbus_dispatch_tests.rs:402:53:
output written: Os { code: 2, kind: NotFound, message: "No such file or directory" }

failures:
    story_105::test_BC_2_14_023_all_flag_enables_modbus
    story_105::test_BC_2_14_023_modbus_alone_triggers_reassembly
    story_105::test_BC_2_14_023_modbus_disabled_by_default
    story_105::test_BC_2_14_023_modbus_flag_enables_analyzer_empty_pcap

test result: FAILED. 26 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.31s

*** result: Failure(101)
