*** src/main.rs:491:9: delete match arm (_, Some(Some(path))) in write_output

*** mutation diff:
--- src/main.rs
+++ delete match arm (_, Some(Some(path))) in write_output
@@ -483,18 +483,17 @@
 /// was given with a path) or to stdout otherwise.
 ///
 /// `--json` and `--csv` are mutually exclusive (enforced by clap), so at
 /// most one of the file-path arms can be active.
 fn write_output(output: &str, cli: &Cli) -> Result<()> {
     match (&cli.json, &cli.csv) {
         (Some(Some(path)), _) => std::fs::write(path, output)
             .with_context(|| format!("Failed to write JSON output to {}", path.display())),
-        (_, Some(Some(path))) => std::fs::write(path, output)
-            .with_context(|| format!("Failed to write CSV output to {}", path.display())),
+         /* ~ changed by cargo-mutants ~ */
         _ => {
             println!("{output}");
             Ok(())
         }
     }
 }
 
 /// Maps the `--no-collapse` opt-out flag to the `TerminalReporter` `collapse_findings`

---- csv_flag_with_path_writes_csv_findings_table stdout ----

thread 'csv_flag_with_path_writes_csv_findings_table' (177194527) panicked at tests/cli_integration_tests.rs:96:54:
output file exists: Os { code: 2, kind: NotFound, message: "No such file or directory" }

failures:
    csv_flag_with_path_writes_csv_findings_table

test result: FAILED. 8 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
