*** src/main.rs:506:5: replace collapse_findings_from_flag -> bool with true

*** mutation diff:
--- src/main.rs
+++ replace collapse_findings_from_flag -> bool with true
@@ -498,17 +498,17 @@
 }
 
 /// Maps the `--no-collapse` opt-out flag to the `TerminalReporter` `collapse_findings`
 /// field (default-on per BC-2.11.028).
 ///
 /// When the flag is absent (`no_collapse = false`), collapse is ON (`true`).
 /// When `--no-collapse` is passed (`no_collapse = true`), collapse is OFF (`false`).
 fn collapse_findings_from_flag(no_collapse: bool) -> bool {
-    !no_collapse
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 /// Maps the `--mitre` flag to the `FindingsRender` `grouping` field
 /// (BC-2.11.030 PC-2 through PC-5).
 ///
 /// When `--mitre` is present (`show_mitre_grouping = true`), grouping is `Grouped`.
 /// When `--mitre` is absent (`show_mitre_grouping = false`), grouping is `Flat`.
 fn grouping_from_flag(show_mitre_grouping: bool) -> Grouping {

---- tests::test_bc_2_11_028_collapse_flag_polarity stdout ----

thread 'tests::test_bc_2_11_028_collapse_flag_polarity' (177196277) panicked at src/main.rs:560:9:
--no-collapse (no_collapse=true) must yield collapse_findings=false

failures:
    tests::test_bc_2_11_028_collapse_flag_polarity

test result: FAILED. 1 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
