*** src/main.rs:523:5: replace resolve_targets -> Result<Vec<std::path::PathBuf>> with Ok(vec![])

*** mutation diff:
--- src/main.rs
+++ replace resolve_targets -> Result<Vec<std::path::PathBuf>> with Ok(vec![])
@@ -515,35 +515,17 @@
     if show_mitre_grouping {
         Grouping::Grouped
     } else {
         Grouping::Flat
     }
 }
 
 fn resolve_targets(target: &Path) -> Result<Vec<std::path::PathBuf>> {
-    if target.is_file() {
-        return Ok(vec![target.to_path_buf()]);
-    }
-    if target.is_dir() {
-        let mut files = Vec::new();
-        for entry in std::fs::read_dir(target)? {
-            let entry = entry?;
-            let path = entry.path();
-            if path.is_file()
-                && let Some(ext) = path.extension()
-                && ext == "pcap"
-            {
-                files.push(path);
-            }
-        }
-        files.sort();
-        return Ok(files);
-    }
-    anyhow::bail!("Target not found: {}", target.display());
+    Ok(vec![]) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::{collapse_findings_from_flag, grouping_from_flag};
     use wirerust::reporter::terminal::Grouping;
 
     /// BC-2.11.028: flag absent (false) → collapse ON (true);

---- story_115_integration::test_integration_arp_storm_end_to_end stdout ----

thread 'story_115_integration::test_integration_arp_storm_end_to_end' (177202359) panicked at tests/bc_2_16_story115_arp_tests.rs:300:13:
AC-015 / BC-2.16.008: a D3 storm finding with confidence=MEDIUM must appear in the JSON output after processing 10 ARP frames at ts=100 with --arp-storm-rate 10 (rate=10/1=10 >= 10). Got findings: [].

failures:
    story_115_integration::test_integration_arp_storm_end_to_end

test result: FAILED. 3 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
