*** src/main.rs:523:5: replace resolve_targets -> Result<Vec<std::path::PathBuf>> with Ok(vec![Default::default()])

*** mutation diff:
--- src/main.rs
+++ replace resolve_targets -> Result<Vec<std::path::PathBuf>> with Ok(vec![Default::default()])
@@ -515,35 +515,17 @@
     if show_mitre_grouping {
         Grouping::Grouped
     } else {
         Grouping::Flat
     }
 }
 
 fn resolve_targets(target: &Path) -> Result<Vec<std::path::PathBuf>> {
-    if target.is_file() {
-        return Ok(vec![target.to_path_buf()]);
-    }
-    if target.is_dir() {
-        let mut files = Vec::new();
-        for entry in std::fs::read_dir(target)? {
-            let entry = entry?;
-            let path = entry.path();
-            if path.is_file()
-                && let Some(ext) = path.extension()
-                && ext == "pcap"
-            {
-                files.push(path);
-            }
-        }
-        files.sort();
-        return Ok(files);
-    }
-    anyhow::bail!("Target not found: {}", target.display());
+    Ok(vec![Default::default()]) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::{collapse_findings_from_flag, grouping_from_flag};
     use wirerust::reporter::terminal::Grouping;
 
     /// BC-2.11.028: flag absent (false) → collapse ON (true);

---- story_105::test_BC_2_14_023_modbus_flag_enables_analyzer_empty_pcap stdout ----

thread 'story_105::test_BC_2_14_023_modbus_flag_enables_analyzer_empty_pcap' (177204351) panicked at tests/bc_2_14_105_modbus_dispatch_tests.rs:450:14:
Unexpected failure.
code=1
stderr=``````
Error: Failed to read 

Caused by:
    0: Failed to open 
    1: No such file or directory (os error 2)
```
```
command=`"/private/var/folders/p5/tjcpsj_90sd8b2t321cqpf600000gn/T/cargo-mutants-wirerust-ePVJFG.tmp/target/debug/wirerust" "analyze" "--modbus" "--json" "/var/folders/p5/tjcpsj_90sd8b2t321cqpf600000gn/T/.tmpJY44db/out.json" "tests/fixtures/http-ooo.pcap"`

---- story_105::test_BC_2_14_023_modbus_with_no_reassemble_prints_warning stdout ----

thread 'story_105::test_BC_2_14_023_modbus_with_no_reassemble_prints_warning' (177204352) panicked at tests/bc_2_14_105_modbus_dispatch_tests.rs:539:9:
exit code must be 0

---- story_105::test_BC_2_14_023_all_flag_enables_modbus stdout ----

thread 'story_105::test_BC_2_14_023_all_flag_enables_modbus' (177204348) panicked at tests/bc_2_14_105_modbus_dispatch_tests.rs:489:14:
Unexpected failure.
code=1
stderr=``````
Error: Failed to read 

Caused by:
    0: Failed to open 
    1: No such file or directory (os error 2)
```
```
command=`"/private/var/folders/p5/tjcpsj_90sd8b2t321cqpf600000gn/T/cargo-mutants-wirerust-ePVJFG.tmp/target/debug/wirerust" "analyze" "--all" "--json" "/var/folders/p5/tjcpsj_90sd8b2t321cqpf600000gn/T/.tmpM9XYnF/out.json" "tests/fixtures/http-ooo.pcap"`

failures:
    story_105::test_BC_2_14_023_all_flag_enables_modbus
    story_105::test_BC_2_14_023_modbus_alone_triggers_reassembly
    story_105::test_BC_2_14_023_modbus_disabled_by_default
    story_105::test_BC_2_14_023_modbus_flag_enables_analyzer_empty_pcap
    story_105::test_BC_2_14_023_modbus_with_no_reassemble_prints_warning

test result: FAILED. 25 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.31s

*** result: Failure(101)
