*** src/main.rs:533:24: replace == with != in resolve_targets

*** mutation diff:
--- src/main.rs
+++ replace == with != in resolve_targets
@@ -525,17 +525,17 @@
     }
     if target.is_dir() {
         let mut files = Vec::new();
         for entry in std::fs::read_dir(target)? {
             let entry = entry?;
             let path = entry.path();
             if path.is_file()
                 && let Some(ext) = path.extension()
-                && ext == "pcap"
+                && ext != /* ~ changed by cargo-mutants ~ */ "pcap"
             {
                 files.push(path);
             }
         }
         files.sort();
         return Ok(files);
     }
     anyhow::bail!("Target not found: {}", target.display());

---- story_088::test_resolve_targets_case_sensitive_extension_exclusion stdout ----

thread 'story_088::test_resolve_targets_case_sensitive_extension_exclusion' (177208545) panicked at tests/main_story_088_tests.rs:463:14:
Unexpected stdout, failed var.contains(Packets: 0)
├── var: WIRERUST TRIAGE REPORT
│   ────────────────────────────────────────
│     Packets: 16  Bytes: 929  Hosts: 2
│   
│   PROTOCOLS
│   ────────────────────────────────────────
│     Tcp: 16
│   
│   SERVICES
│   ────────────────────────────────────────

---- story_088::test_EC_005_directory_files_returned_sorted stdout ----

thread 'story_088::test_EC_005_directory_files_returned_sorted' (177208534) panicked at tests/main_story_088_tests.rs:782:14:
iuident URI must appear in recent_uris (http.pcap processed)

---- story_088::test_resolve_targets_directory_pcap_only_sorted stdout ----

thread 'story_088::test_resolve_targets_directory_pcap_only_sorted' (177208547) panicked at tests/main_story_088_tests.rs:408:14:
Unexpected failure.
code=1
stderr=``````
Error: Failed to read /var/folders/p5/tjcpsj_90sd8b2t321cqpf600000gn/T/.tmp93fxQz/c.pcapng

Caused by:
    0: Failed to parse pcap header
    1: Invalid field value: PcapHeader: wrong magic number
```
```
command=`"/private/var/folders/p5/tjcpsj_90sd8b2t321cqpf600000gn/T/cargo-mutants-wirerust-ePVJFG.tmp/target/debug/wirerust" "analyze" "/var/folders/p5/tjcpsj_90sd8b2t321cqpf600000gn/T/.tmp93fxQz" "--no-color" "--all" "--json"`

failures:
    story_088::test_EC_002_uppercase_pcap_extension_excluded
    story_088::test_EC_005_directory_files_returned_sorted
    story_088::test_resolve_targets_case_sensitive_extension_exclusion
    story_088::test_resolve_targets_directory_pcap_only_sorted

test result: FAILED. 15 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
