*** src/main.rs:68:22: replace || with && in main

*** mutation diff:
--- src/main.rs
+++ replace || with && in main
@@ -60,17 +60,17 @@
             dnp3,
             dnp3_direct_operate_threshold,
             arp,
             arp_spoof_threshold,
             arp_storm_rate,
         } => {
             run_analyze(
                 targets,
-                *dns || *all,
+                *dns && /* ~ changed by cargo-mutants ~ */ *all,
                 *http || *all,
                 *tls || *all,
                 *modbus || *all,
                 *modbus_write_burst_threshold,
                 *modbus_write_sustained_threshold,
                 *dnp3 || *all,
                 *dnp3_direct_operate_threshold,
                 *arp || *all,

---- story_088::test_dns_analyzer_constructed_without_reassembly stdout ----

thread 'story_088::test_dns_analyzer_constructed_without_reassembly' (177020632) panicked at tests/main_story_088_tests.rs:283:14:
Unexpected stdout, failed var.contains(ANALYZER: DNS)
├── var: WIRERUST TRIAGE REPORT
│   ────────────────────────────────────────
│     Packets: 58  Bytes: 7542  Hosts: 3
│     Skipped: 69 packets (decode errors)
│   
│   PROTOCOLS
│   ────────────────────────────────────────
│     Tcp: 52
│     Udp: 6
│

---- story_088::test_all_flag_enables_all_three_analyzers stdout ----

thread 'story_088::test_all_flag_enables_all_three_analyzers' (177020631) panicked at tests/main_story_088_tests.rs:83:14:
Unexpected stdout, failed var.contains(ANALYZER: DNS)
├── var: WIRERUST TRIAGE REPORT
│   ────────────────────────────────────────
│     Packets: 16  Bytes: 929  Hosts: 2
│   
│   PROTOCOLS
│   ────────────────────────────────────────
│     Tcp: 16
│   
│   SERVICES
│   ────────────────────────────────────────

failures:
    story_088::test_all_flag_enables_all_three_analyzers
    story_088::test_dns_analyzer_constructed_without_reassembly

test result: FAILED. 17 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
