*** src/main.rs:69:23: replace || with && in main

*** mutation diff:
--- src/main.rs
+++ replace || with && in main
@@ -61,17 +61,17 @@
             dnp3_direct_operate_threshold,
             arp,
             arp_spoof_threshold,
             arp_storm_rate,
         } => {
             run_analyze(
                 targets,
                 *dns || *all,
-                *http || *all,
+                *http && /* ~ changed by cargo-mutants ~ */ *all,
                 *tls || *all,
                 *modbus || *all,
                 *modbus_write_burst_threshold,
                 *modbus_write_sustained_threshold,
                 *dnp3 || *all,
                 *dnp3_direct_operate_threshold,
                 *arp || *all,
                 *arp_spoof_threshold,

---- mitre_no_collapse_emits_tactic_headers_without_collapse_suffix stdout ----

thread 'mitre_no_collapse_emits_tactic_headers_without_collapse_suffix' (177021712) panicked at tests/cli_integration_tests.rs:237:5:
BC-2.11.030 PC-3: `--mitre --no-collapse` must emit MITRE tactic headers ('## '); got stdout:
WIRERUST TRIAGE REPORT
────────────────────────────────────────
  Packets: 16  Bytes: 929  Hosts: 2

PROTOCOLS
────────────────────────────────────────
  Tcp: 16

SERVICES
────────────────────────────────────────

---- mitre_flag_emits_tactic_headers_and_collapse_suffix stdout ----

thread 'mitre_flag_emits_tactic_headers_and_collapse_suffix' (177021711) panicked at tests/cli_integration_tests.rs:209:5:
BC-2.11.030 PC-2: `--mitre` must emit MITRE tactic section headers ('## '); got stdout:
WIRERUST TRIAGE REPORT
────────────────────────────────────────
  Packets: 16  Bytes: 929  Hosts: 2

PROTOCOLS
────────────────────────────────────────
  Tcp: 16

SERVICES
────────────────────────────────────────

---- csv_flag_with_path_writes_csv_findings_table stdout ----

thread 'csv_flag_with_path_writes_csv_findings_table' (177021706) panicked at tests/cli_integration_tests.rs:106:5:
CSV must contain at least one finding row for the --all analysis of the fixture

failures:
    csv_flag_with_path_writes_csv_findings_table
    mitre_flag_emits_tactic_headers_and_collapse_suffix
    mitre_no_collapse_emits_tactic_headers_without_collapse_suffix

test result: FAILED. 6 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
