*** src/main.rs:70:22: replace || with && in main

*** mutation diff:
--- src/main.rs
+++ replace || with && in main
@@ -62,17 +62,17 @@
             arp,
             arp_spoof_threshold,
             arp_storm_rate,
         } => {
             run_analyze(
                 targets,
                 *dns || *all,
                 *http || *all,
-                *tls || *all,
+                *tls && /* ~ changed by cargo-mutants ~ */ *all,
                 *modbus || *all,
                 *modbus_write_burst_threshold,
                 *modbus_write_sustained_threshold,
                 *dnp3 || *all,
                 *dnp3_direct_operate_threshold,
                 *arp || *all,
                 *arp_spoof_threshold,
                 *arp_storm_rate,

---- story_088::test_all_flag_enables_all_three_analyzers stdout ----

thread 'story_088::test_all_flag_enables_all_three_analyzers' (177023185) panicked at tests/main_story_088_tests.rs:85:14:
Unexpected stdout, failed var.contains(ANALYZER: TLS)
├── var: WIRERUST TRIAGE REPORT
│   ────────────────────────────────────────
│     Packets: 16  Bytes: 929  Hosts: 2
│   
│   PROTOCOLS
│   ────────────────────────────────────────
│     Tcp: 16
│   
│   SERVICES
│   ────────────────────────────────────────

failures:
    story_088::test_all_flag_enables_all_three_analyzers

test result: FAILED. 18 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
