*** src/main.rs:71:25: replace || with && in main

*** mutation diff:
--- src/main.rs
+++ replace || with && in main
@@ -63,17 +63,17 @@
             arp_spoof_threshold,
             arp_storm_rate,
         } => {
             run_analyze(
                 targets,
                 *dns || *all,
                 *http || *all,
                 *tls || *all,
-                *modbus || *all,
+                *modbus && /* ~ changed by cargo-mutants ~ */ *all,
                 *modbus_write_burst_threshold,
                 *modbus_write_sustained_threshold,
                 *dnp3 || *all,
                 *dnp3_direct_operate_threshold,
                 *arp || *all,
                 *arp_spoof_threshold,
                 *arp_storm_rate,
                 *mitre,

---- story_105::test_BC_2_14_023_modbus_with_no_reassemble_prints_warning stdout ----

thread 'story_105::test_BC_2_14_023_modbus_with_no_reassemble_prints_warning' (177024020) panicked at tests/bc_2_14_105_modbus_dispatch_tests.rs:542:9:
stderr must contain the reassembly warning (BC-2.14.023 EC-001), got: ""

---- story_105::test_BC_2_14_023_modbus_alone_triggers_reassembly stdout ----

thread 'story_105::test_BC_2_14_023_modbus_alone_triggers_reassembly' (177024017) panicked at tests/bc_2_14_105_modbus_dispatch_tests.rs:716:9:
Modbus analyzer summary MUST appear when --modbus alone triggers reassembly (BC-2.14.023 P4, AC-010). Got analyzers: []

---- story_105::test_BC_2_14_023_modbus_flag_enables_analyzer_empty_pcap stdout ----

thread 'story_105::test_BC_2_14_023_modbus_flag_enables_analyzer_empty_pcap' (177024019) panicked at tests/bc_2_14_105_modbus_dispatch_tests.rs:463:9:
Modbus section MUST appear in output when --modbus is provided (BC-2.14.023 P2). Analyzers found: []

failures:
    story_105::test_BC_2_14_023_all_flag_enables_modbus
    story_105::test_BC_2_14_023_modbus_alone_triggers_reassembly
    story_105::test_BC_2_14_023_modbus_flag_enables_analyzer_empty_pcap
    story_105::test_BC_2_14_023_modbus_with_no_reassemble_prints_warning

test result: FAILED. 26 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.34s

*** result: Failure(101)
