*** src/main.rs:74:23: replace || with && in main

*** mutation diff:
--- src/main.rs
+++ replace || with && in main
@@ -66,17 +66,17 @@
             run_analyze(
                 targets,
                 *dns || *all,
                 *http || *all,
                 *tls || *all,
                 *modbus || *all,
                 *modbus_write_burst_threshold,
                 *modbus_write_sustained_threshold,
-                *dnp3 || *all,
+                *dnp3 && /* ~ changed by cargo-mutants ~ */ *all,
                 *dnp3_direct_operate_threshold,
                 *arp || *all,
                 *arp_spoof_threshold,
                 *arp_storm_rate,
                 *mitre,
                 collapse_findings_from_flag(*no_collapse),
                 use_color,
                 &cli,

*** result: Success
