*** src/main.rs:76:22: replace || with && in main

*** mutation diff:
--- src/main.rs
+++ replace || with && in main
@@ -68,17 +68,17 @@
                 *dns || *all,
                 *http || *all,
                 *tls || *all,
                 *modbus || *all,
                 *modbus_write_burst_threshold,
                 *modbus_write_sustained_threshold,
                 *dnp3 || *all,
                 *dnp3_direct_operate_threshold,
-                *arp || *all,
+                *arp && /* ~ changed by cargo-mutants ~ */ *all,
                 *arp_spoof_threshold,
                 *arp_storm_rate,
                 *mitre,
                 collapse_findings_from_flag(*no_collapse),
                 use_color,
                 &cli,
             )?;
         }

---- story_113_cli::test_BC_2_16_011_main_arp_flag_present_summarize_appended stdout ----

thread 'story_113_cli::test_BC_2_16_011_main_arp_flag_present_summarize_appended' (177027990) panicked at tests/bc_2_16_story113_arp_tests.rs:150:14:
AC-016 / BC-2.16.011 PC7: ARP AnalysisSummary must be present in the "analyzers" array when --arp flag is active. No 'ARP' entry found.

failures:
    story_113_cli::test_BC_2_16_011_main_arp_flag_present_summarize_appended

test result: FAILED. 1 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
