*** src/reporter/terminal.rs:175:36: replace > with < in <impl Reporter for TerminalReporter>::render

*** mutation diff:
--- src/reporter/terminal.rs
+++ replace > with < in <impl Reporter for TerminalReporter>::render
@@ -167,17 +167,17 @@
         // Header
         out.push_str(&self.section("WIRERUST TRIAGE REPORT"));
         out.push_str(&format!(
             "  Packets: {}  Bytes: {}  Hosts: {}\n",
             summary.total_packets,
             summary.total_bytes,
             summary.unique_hosts().len(),
         ));
-        if summary.skipped_packets > 0 {
+        if summary.skipped_packets < /* ~ changed by cargo-mutants ~ */ 0 {
             let warning = format!(
                 "  Skipped: {} packets (decode errors)\n",
                 summary.skipped_packets
             );
             if self.use_color {
                 out.push_str(&warning.yellow().to_string());
             } else {
                 out.push_str(&warning);

---- story_077::test_BC_2_11_006_skipped_packets_nonzero_line_present stdout ----

thread 'story_077::test_BC_2_11_006_skipped_packets_nonzero_line_present' (177437656) panicked at tests/reporter_terminal_tests.rs:137:9:
BC-2.11.006 pc1: expected 'Skipped: 5 packets (decode errors)' in output; got: WIRERUST TRIAGE REPORT
────────────────────────────────────────
  Packets: 0  Bytes: 0  Hosts: 0

PROTOCOLS
────────────────────────────────────────

failures:
    story_077::test_BC_2_11_006_skipped_packets_nonzero_line_present

test result: FAILED. 121 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
