*** src/reporter/terminal.rs:196:16: delete ! in <impl Reporter for TerminalReporter>::render

*** mutation diff:
--- src/reporter/terminal.rs
+++ delete ! in <impl Reporter for TerminalReporter>::render
@@ -188,17 +188,17 @@
         // LESSON-P1.03: optional per-host breakdown, gated by the
         // `summary --hosts` flag. Renders one line per unique
         // source/destination IP observed in the capture, in the
         // sorted-by-address order returned by `Summary::unique_hosts()`.
         // The always-on `Hosts: N` count in the header is kept; this
         // section is the expanded itemized list.
         if self.show_hosts_breakdown {
             let hosts = summary.unique_hosts();
-            if !hosts.is_empty() {
+            if  /* ~ changed by cargo-mutants ~ */hosts.is_empty() {
                 out.push_str(&self.section("HOSTS"));
                 for host in &hosts {
                     out.push_str(&format!("  {host}\n"));
                 }
                 out.push('\n');
             }
         }

---- test_terminal_hosts_breakdown_lists_each_host_when_enabled stdout ----

thread 'test_terminal_hosts_breakdown_lists_each_host_when_enabled' (177500886) panicked at tests/reporter_tests.rs:483:5:
HOSTS section must be present when show_hosts_breakdown is true; got: WIRERUST TRIAGE REPORT
────────────────────────────────────────
  Packets: 1  Bytes: 60  Hosts: 2

PROTOCOLS
────────────────────────────────────────
  Tcp: 1

SERVICES
────────────────────────────────────────
  HTTP: 1

failures:
    test_terminal_hosts_breakdown_lists_each_host_when_enabled

test result: FAILED. 65 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
