*** src/reporter/terminal.rs:219:12: delete ! in <impl Reporter for TerminalReporter>::render

*** mutation diff:
--- src/reporter/terminal.rs
+++ delete ! in <impl Reporter for TerminalReporter>::render
@@ -211,17 +211,17 @@
         });
         for (proto, count) in &proto_vec {
             out.push_str(&format!("  {proto:?}: {count}\n"));
         }
         out.push('\n');
 
         // Services
         let services = summary.service_counts();
-        if !services.is_empty() {
+        if  /* ~ changed by cargo-mutants ~ */services.is_empty() {
             out.push_str(&self.section("SERVICES"));
             let mut svc_vec: Vec<_> = services.iter().collect();
             svc_vec.sort_by(|a, b| b.1.cmp(a.1).then_with(|| a.0.cmp(b.0)));
             for (svc, count) in &svc_vec {
                 out.push_str(&format!("  {svc}: {count}\n"));
             }
             out.push('\n');
         }

---- fix_p5_003_terminal_ordering::test_terminal_services_sorted_count_then_name stdout ----

thread 'fix_p5_003_terminal_ordering::test_terminal_services_sorted_count_then_name' (177533583) panicked at tests/reporter_terminal_tests.rs:1701:9:
FIX-P5-003: SERVICES section must be present in rendered output; got:
WIRERUST TRIAGE REPORT
────────────────────────────────────────
  Packets: 61  Bytes: 3294  Hosts: 2

PROTOCOLS
────────────────────────────────────────
  Tcp: 61

---- story_078::test_BC_2_11_019_services_section_absent_when_empty stdout ----

thread 'story_078::test_BC_2_11_019_services_section_absent_when_empty' (177533614) panicked at tests/reporter_terminal_tests.rs:1304:9:
BC-2.11.019 inv3: 'SERVICES' section must be absent when service_counts() empty; got:
WIRERUST TRIAGE REPORT
────────────────────────────────────────
  Packets: 0  Bytes: 0  Hosts: 0

PROTOCOLS
────────────────────────────────────────

SERVICES
────────────────────────────────────────

failures:
    fix_p5_003_terminal_ordering::test_terminal_services_sorted_count_then_name
    story_078::test_BC_2_11_019_services_section_absent_when_empty

test result: FAILED. 120 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
