*** src/reporter/terminal.rs:230:12: delete ! in <impl Reporter for TerminalReporter>::render

*** mutation diff:
--- src/reporter/terminal.rs
+++ delete ! in <impl Reporter for TerminalReporter>::render
@@ -222,17 +222,17 @@
             svc_vec.sort_by(|a, b| b.1.cmp(a.1).then_with(|| a.0.cmp(b.0)));
             for (svc, count) in &svc_vec {
                 out.push_str(&format!("  {svc}: {count}\n"));
             }
             out.push('\n');
         }
 
         // Findings
-        if !findings.is_empty() {
+        if  /* ~ changed by cargo-mutants ~ */findings.is_empty() {
             out.push_str(&self.section("FINDINGS"));
             match (self.render.grouping, self.render.collapse) {
                 (Grouping::Grouped, Collapse::Expanded) => {
                     self.render_findings_grouped(&mut out, findings);
                 }
                 (Grouping::Grouped, Collapse::Collapsed) => {
                     self.render_findings_grouped_collapsed(&mut out, findings);
                 }

---- test_BC_2_09_001_singleton_vec_terminal_output_byte_identical_to_pre_migration stdout ----

thread 'test_BC_2_09_001_singleton_vec_terminal_output_byte_identical_to_pre_migration' (177546865) panicked at tests/bc_2_09_100_multitag_tests.rs:1029:5:
regression: singleton vec terminal MITRE line must render as 'MITRE: T1027' (same as pre-migration); got:
WIRERUST TRIAGE REPORT
────────────────────────────────────────
  Packets: 0  Bytes: 0  Hosts: 0

PROTOCOLS
────────────────────────────────────────

---- test_BC_2_11_013_terminal_tactic_grouping_uses_first_technique stdout ----

thread 'test_BC_2_11_013_terminal_tactic_grouping_uses_first_technique' (177546891) panicked at tests/bc_2_09_100_multitag_tests.rs:722:5:
BC-2.11.013: findings with IcsImpairProcessControl first-technique must be grouped under 'Impair Process Control' bucket; got:
WIRERUST TRIAGE REPORT
────────────────────────────────────────
  Packets: 0  Bytes: 0  Hosts: 0

PROTOCOLS
────────────────────────────────────────

---- test_BC_2_11_015_terminal_empty_techniques_lands_in_uncategorized stdout ----

thread 'test_BC_2_11_015_terminal_empty_techniques_lands_in_uncategorized' (177546892) panicked at tests/bc_2_09_100_multitag_tests.rs:747:5:
BC-2.11.015: finding with empty mitre_techniques must appear under '## Uncategorized' in grouped terminal output; got:
WIRERUST TRIAGE REPORT
────────────────────────────────────────
  Packets: 0  Bytes: 0  Hosts: 0

PROTOCOLS
────────────────────────────────────────

failures:
    test_BC_2_09_001_singleton_vec_terminal_output_byte_identical_to_pre_migration
    test_BC_2_11_013_terminal_tactic_grouping_uses_first_technique
    test_BC_2_11_015_terminal_empty_techniques_lands_in_uncategorized
    test_BC_2_11_015_terminal_unknown_id_lands_in_uncategorized
    test_BC_2_11_017_terminal_renders_multi_id_mitre_string
    test_BC_2_11_017_terminal_singleton_technique_render_unchanged

test result: FAILED. 36 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
