*** src/reporter/terminal.rs:278:9: replace TerminalReporter::section -> String with String::new()

*** mutation diff:
--- src/reporter/terminal.rs
+++ replace TerminalReporter::section -> String with String::new()
@@ -270,21 +270,17 @@
         }
 
         out
     }
 }
 
 impl TerminalReporter {
     fn section(&self, title: &str) -> String {
-        if self.use_color {
-            format!("{}\n{}\n", title.bold().underline(), "─".repeat(40))
-        } else {
-            format!("{title}\n{}\n", "─".repeat(40))
-        }
+        String::new() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Emits the shared per-finding prefix: the colored `[category] verdict
     /// (confidence) - summary` header line followed by each evidence line.
     /// Summary and evidence strings are escaped per ADR 0003 before being
     /// written to the TTY. Callers own the trailing MITRE line — see
     /// [`render_finding_flat`] and [`render_finding_grouped`].
     fn render_finding_prefix(&self, out: &mut String, f: &Finding) {

---- story_088::test_needs_reassembly_formula stdout ----

thread 'story_088::test_needs_reassembly_formula' (177574927) panicked at tests/main_story_088_tests.rs:160:14:
Unexpected stdout, failed var.contains(ANALYZER: HTTP)
├── var:   Packets: 16  Bytes: 929  Hosts: 2
│   
│     Tcp: 16
│   
│     HTTP: 16
│   
│     [Anomaly] INCONCLUSIVE (MEDIUM) - HTTP/1.1 request without Host header (x5)
│       > PUT /1
│       > GET /2
│       > PUT /3

---- story_088::test_dns_analyzer_constructed_without_reassembly stdout ----

thread 'story_088::test_dns_analyzer_constructed_without_reassembly' (177574926) panicked at tests/main_story_088_tests.rs:283:14:
Unexpected stdout, failed var.contains(ANALYZER: DNS)
├── var:   Packets: 58  Bytes: 7542  Hosts: 3
│     Skipped: 69 packets (decode errors)
│   
│     Tcp: 52
│     Udp: 6
│   
│     DNS: 18
│     HTTP: 12
│   
│     Packets analyzed: 18

---- story_088::test_all_flag_enables_all_three_analyzers stdout ----

thread 'story_088::test_all_flag_enables_all_three_analyzers' (177574925) panicked at tests/main_story_088_tests.rs:83:14:
Unexpected stdout, failed var.contains(ANALYZER: DNS)
├── var:   Packets: 16  Bytes: 929  Hosts: 2
│   
│     Tcp: 16
│   
│     HTTP: 16
│   
│     [Anomaly] INCONCLUSIVE (MEDIUM) - HTTP/1.1 request without Host header (x5)
│       > PUT /1
│       > GET /2
│       > PUT /3

failures:
    story_088::test_all_flag_enables_all_three_analyzers
    story_088::test_dns_analyzer_constructed_without_reassembly
    story_088::test_needs_reassembly_formula
    story_088::test_no_reassemble_skips_http_and_tls_constructors

test result: FAILED. 15 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
