*** src/reporter/terminal.rs:278:9: replace TerminalReporter::section -> String with "xyzzy".into()

*** mutation diff:
--- src/reporter/terminal.rs
+++ replace TerminalReporter::section -> String with "xyzzy".into()
@@ -270,21 +270,17 @@
         }
 
         out
     }
 }
 
 impl TerminalReporter {
     fn section(&self, title: &str) -> String {
-        if self.use_color {
-            format!("{}\n{}\n", title.bold().underline(), "─".repeat(40))
-        } else {
-            format!("{title}\n{}\n", "─".repeat(40))
-        }
+        "xyzzy".into() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Emits the shared per-finding prefix: the colored `[category] verdict
     /// (confidence) - summary` header line followed by each evidence line.
     /// Summary and evidence strings are escaped per ADR 0003 before being
     /// written to the TTY. Callers own the trailing MITRE line — see
     /// [`render_finding_flat`] and [`render_finding_grouped`].
     fn render_finding_prefix(&self, out: &mut String, f: &Finding) {

---- f5_ics_impact_display::test_reporter_renders_distinct_impact_sections stdout ----

thread 'f5_ics_impact_display::test_reporter_renders_distinct_impact_sections' (177599364) panicked at tests/dnp3_f5_remediation_tests.rs:1121:9:
assertion `left == right` failed: expected 2 DISTINCT tactic section headers for Impact and IcsImpact; got 1 unique header(s): {"  ## Impact (ICS)"}.
Output:
xyzzy  Packets: 0  Bytes: 0  Hosts: 0

xyzzy
xyzzy  ## Impact
  [Execution] LIKELY (MEDIUM) - Service Exhaustion Flood detected
    MITRE: T1499.002 — Service Exhaustion Flood
  ## Impact (ICS)
  [Execution] LIKELY (MEDIUM) - DNP3 loss of control: combined restart+block events threshold crossed
    MITRE: T0827 — Loss of Control

failures:
    f5_ics_impact_display::test_reporter_renders_distinct_impact_sections

test result: FAILED. 19 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
