*** src/reporter/terminal.rs:291:9: replace TerminalReporter::render_finding_prefix with ()

*** mutation diff:
--- src/reporter/terminal.rs
+++ replace TerminalReporter::render_finding_prefix with ()
@@ -283,39 +283,17 @@
     }
 
     /// Emits the shared per-finding prefix: the colored `[category] verdict
     /// (confidence) - summary` header line followed by each evidence line.
     /// Summary and evidence strings are escaped per ADR 0003 before being
     /// written to the TTY. Callers own the trailing MITRE line — see
     /// [`render_finding_flat`] and [`render_finding_grouped`].
     fn render_finding_prefix(&self, out: &mut String, f: &Finding) {
-        let escaped_summary = escape_for_terminal(&f.summary);
-        let line = format!(
-            "[{}] {} ({}) - {}",
-            f.category, f.verdict, f.confidence, escaped_summary
-        );
-        let colored = if self.use_color {
-            match f.verdict {
-                Verdict::Likely => match f.confidence {
-                    Confidence::High => line.red().bold().to_string(),
-                    _ => line.yellow().to_string(),
-                },
-                Verdict::Possible => line.yellow().to_string(),
-                Verdict::Inconclusive => line.cyan().to_string(),
-                Verdict::Unlikely => line.dimmed().to_string(),
-            }
-        } else {
-            line
-        };
-        out.push_str(&format!("  {colored}\n"));
-        for ev in &f.evidence {
-            let escaped_ev = escape_for_terminal(ev);
-            out.push_str(&format!("    > {escaped_ev}\n"));
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Renders a single finding in the default flat view. MITRE line, if
     /// non-empty, shows comma-space joined technique IDs.
     /// BC-2.11.017: multi-ID renders as `MITRE: T1692.001, T0836`; empty vec → no line.
     fn render_finding_flat(&self, out: &mut String, f: &Finding) {
         self.render_finding_prefix(out, f);
         if !f.mitre_techniques.is_empty() {

---- story_077::test_BC_2_11_008_printable_ascii_preserved stdout ----

thread 'story_077::test_BC_2_11_008_printable_ascii_preserved' (177635224) panicked at tests/reporter_terminal_tests.rs:263:9:
BC-2.11.008 pc1: printable ASCII (excl. backslash) must pass through unchanged; got: WIRERUST TRIAGE REPORT
────────────────────────────────────────
  Packets: 0  Bytes: 0  Hosts: 0

PROTOCOLS
────────────────────────────────────────

FINDINGS
────────────────────────────────────────

---- story_077::test_BC_2_11_009_c1_boundary_inclusive stdout ----

thread 'story_077::test_BC_2_11_009_c1_boundary_inclusive' (177635225) panicked at tests/reporter_terminal_tests.rs:415:9:
BC-2.11.009 inv2: U+0080 (C1 lower boundary) must be escaped to '\u{80}'; got: WIRERUST TRIAGE REPORT
────────────────────────────────────────
  Packets: 0  Bytes: 0  Hosts: 0

PROTOCOLS
────────────────────────────────────────

FINDINGS
────────────────────────────────────────

---- story_077::test_BC_2_11_008_cyrillic_and_emoji_preserved stdout ----

thread 'story_077::test_BC_2_11_008_cyrillic_and_emoji_preserved' (177635223) panicked at tests/reporter_terminal_tests.rs:294:9:
BC-2.11.008 pc2: Cyrillic 'пример.рф' must pass through unchanged; got: WIRERUST TRIAGE REPORT
────────────────────────────────────────
  Packets: 0  Bytes: 0  Hosts: 0

PROTOCOLS
────────────────────────────────────────

FINDINGS
────────────────────────────────────────

failures:
    story_077::test_BC_2_11_007_backslash_escaped
    story_077::test_BC_2_11_007_del_escaped
    story_077::test_BC_2_11_007_esc_byte_escaped
    story_077::test_BC_2_11_008_cyrillic_and_emoji_preserved
    story_077::test_BC_2_11_008_printable_ascii_preserved
    story_077::test_BC_2_11_009_c1_boundary_inclusive
    story_077::test_BC_2_11_009_c1_range_escaped
    story_077::test_BC_2_11_009_nbsp_u00a0_preserved
    story_077::test_BC_2_11_010_evidence_each_entry_is_escaped
    story_077::test_BC_2_11_010_summary_is_escaped
    story_077::test_BC_2_11_012_http_finding_c1_end_to_end
    story_078::test_BC_2_11_014_sort_by_confidence_within_same_verdict

test result: FAILED. 88 passed; 34 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
