*** src/reporter/terminal.rs:320:9: replace TerminalReporter::render_finding_flat with ()

*** mutation diff:
--- src/reporter/terminal.rs
+++ replace TerminalReporter::render_finding_flat with ()
@@ -312,21 +312,17 @@
             out.push_str(&format!("    > {escaped_ev}\n"));
         }
     }
 
     /// Renders a single finding in the default flat view. MITRE line, if
     /// non-empty, shows comma-space joined technique IDs.
     /// BC-2.11.017: multi-ID renders as `MITRE: T1692.001, T0836`; empty vec → no line.
     fn render_finding_flat(&self, out: &mut String, f: &Finding) {
-        self.render_finding_prefix(out, f);
-        if !f.mitre_techniques.is_empty() {
-            let ids = f.mitre_techniques.join(", ");
-            out.push_str(&format!("    MITRE: {ids}\n"));
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Renders a single finding in the `--mitre` grouped view. MITRE line,
     /// if non-empty, expands to `ID — Name` for the first ID and `ID (unknown)`
     /// for IDs absent from [`crate::mitre::technique_name`]. Unknown IDs
     /// still render so they surface in audit trails; the regression test
     /// `known_emitted_technique_ids_resolve_in_lookup` in
     /// `tests/mitre_tests.rs` covers the hand-curated set of IDs we

---- test_BC_2_09_001_singleton_vec_terminal_output_byte_identical_to_pre_migration stdout ----

thread 'test_BC_2_09_001_singleton_vec_terminal_output_byte_identical_to_pre_migration' (177690794) panicked at tests/bc_2_09_100_multitag_tests.rs:1029:5:
regression: singleton vec terminal MITRE line must render as 'MITRE: T1027' (same as pre-migration); got:
WIRERUST TRIAGE REPORT
────────────────────────────────────────
  Packets: 0  Bytes: 0  Hosts: 0

PROTOCOLS
────────────────────────────────────────

FINDINGS
────────────────────────────────────────

---- test_BC_2_11_017_terminal_renders_multi_id_mitre_string stdout ----

thread 'test_BC_2_11_017_terminal_renders_multi_id_mitre_string' (177690824) panicked at tests/bc_2_09_100_multitag_tests.rs:782:5:
BC-2.11.017: multi-technique finding must render 'MITRE: T1692.001, T0836' (comma-space separated); got:
WIRERUST TRIAGE REPORT
────────────────────────────────────────
  Packets: 0  Bytes: 0  Hosts: 0

PROTOCOLS
────────────────────────────────────────

FINDINGS
────────────────────────────────────────

---- test_BC_2_11_017_terminal_singleton_technique_render_unchanged stdout ----

thread 'test_BC_2_11_017_terminal_singleton_technique_render_unchanged' (177690825) panicked at tests/bc_2_09_100_multitag_tests.rs:797:5:
BC-2.11.017: singleton technique must render as 'MITRE: T1027'; got:
WIRERUST TRIAGE REPORT
────────────────────────────────────────
  Packets: 0  Bytes: 0  Hosts: 0

PROTOCOLS
────────────────────────────────────────

FINDINGS
────────────────────────────────────────

failures:
    test_BC_2_09_001_singleton_vec_terminal_output_byte_identical_to_pre_migration
    test_BC_2_11_017_terminal_renders_multi_id_mitre_string
    test_BC_2_11_017_terminal_singleton_technique_render_unchanged

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
