*** src/reporter/terminal.rs:335:9: replace TerminalReporter::render_finding_grouped with ()

*** mutation diff:
--- src/reporter/terminal.rs
+++ replace TerminalReporter::render_finding_grouped with ()
@@ -327,31 +327,17 @@
     /// Renders a single finding in the `--mitre` grouped view. MITRE line,
     /// if non-empty, expands to `ID — Name` for the first ID and `ID (unknown)`
     /// for IDs absent from [`crate::mitre::technique_name`]. Unknown IDs
     /// still render so they surface in audit trails; the regression test
     /// `known_emitted_technique_ids_resolve_in_lookup` in
     /// `tests/mitre_tests.rs` covers the hand-curated set of IDs we
     /// currently emit (see issue #67 for the trade-off rationale).
     fn render_finding_grouped(&self, out: &mut String, f: &Finding) {
-        self.render_finding_prefix(out, f);
-        if !f.mitre_techniques.is_empty() {
-            // For the grouped view, show all IDs joined with comma-space.
-            // Expand the first known ID with its name; unknown IDs get "(unknown)".
-            let ids = f.mitre_techniques.join(", ");
-            // Use the first technique ID for expanded name lookup in grouped view.
-            match f
-                .mitre_techniques
-                .first()
-                .and_then(|id| technique_name(id.as_str()))
-            {
-                Some(name) => out.push_str(&format!("    MITRE: {ids} \u{2014} {name}\n")),
-                None => out.push_str(&format!("    MITRE: {ids} (unknown)\n")),
-            }
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Shared collapse-logic helper: groups a slice of finding references by
     /// `CollapseKey` in first-occurrence order.
     ///
     /// This is the single source of collapse logic (ADR-0003 "Collapse-API Shape";
     /// F2 design-note §5.2.1). `collapse_findings_pass` (the flat-mode wrapper)
     /// delegates to this function. `render_findings_grouped_collapsed` calls this

---- story_078::test_BC_2_11_016_separator_is_em_dash_not_ascii_hyphen stdout ----

thread 'story_078::test_BC_2_11_016_separator_is_em_dash_not_ascii_hyphen' (177746132) panicked at tests/reporter_terminal_tests.rs:1072:9:
BC-2.11.016 inv1: U+2014 em-dash must be present as the separator; got:
WIRERUST TRIAGE REPORT
────────────────────────────────────────
  Packets: 0  Bytes: 0  Hosts: 0

PROTOCOLS
────────────────────────────────────────

FINDINGS
────────────────────────────────────────
  ## Defense Evasion

---- story_078::test_BC_2_11_014_sort_by_verdict_within_bucket stdout ----

thread 'story_078::test_BC_2_11_014_sort_by_verdict_within_bucket' (177746127) panicked at tests/reporter_terminal_tests.rs:828:14:
likely-finding not found

---- story_078::test_BC_2_11_014_stable_emission_order_on_tie stdout ----

thread 'story_078::test_BC_2_11_014_stable_emission_order_on_tie' (177746128) panicked at tests/reporter_terminal_tests.rs:911:49:
alpha-first not found

failures:
    story_078::test_BC_2_11_014_sort_by_confidence_within_same_verdict
    story_078::test_BC_2_11_014_sort_by_verdict_within_bucket
    story_078::test_BC_2_11_014_stable_emission_order_on_tie
    story_078::test_BC_2_11_015_none_technique_uncategorized
    story_078::test_BC_2_11_015_unknown_id_uncategorized_with_label
    story_078::test_BC_2_11_016_known_id_em_dash_and_name
    story_078::test_BC_2_11_016_separator_is_em_dash_not_ascii_hyphen
    story_118::test_BC_2_11_013_grouped_mode_suffix_free
    story_118::test_BC_2_11_025_grouped_mode_bypasses_collapse
    story_119::test_BC_2_11_025_distinct_verdict_same_summary_no_merge_in_bucket
    story_119::test_BC_2_11_028_no_collapse_with_mitre_produces_grouped_expanded
    story_122::test_BC_2_11_016_ac008_em_dash_mitre_format_preserved_after_reshape

test result: FAILED. 109 passed; 13 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
