*** src/reporter/terminal.rs:366:9: replace TerminalReporter::collapse_findings_pass_refs -> Vec<(CollapseKey, Vec<&'a Finding>)> with vec![]

*** mutation diff:
--- src/reporter/terminal.rs
+++ replace TerminalReporter::collapse_findings_pass_refs -> Vec<(CollapseKey, Vec<&'a Finding>)> with vec![]
@@ -358,32 +358,17 @@
     /// directly per bucket.
     ///
     /// BC-2.11.025 invariant 7 / postcondition 9: Vec accumulator is canonical —
     /// linear-scan `PartialEq`, no `HashMap`, no `IndexMap`.
     fn collapse_findings_pass_refs<'a>(
         &self,
         refs: &[&'a Finding],
     ) -> Vec<(CollapseKey, Vec<&'a Finding>)> {
-        let mut groups: Vec<(CollapseKey, Vec<&'a Finding>)> = Vec::new();
-        for f in refs {
-            let key = CollapseKey {
-                category: f.category,
-                verdict: f.verdict,
-                confidence: f.confidence,
-                summary: f.summary.clone(),
-            };
-            // Linear-scan PartialEq: find an existing group or create a new one.
-            if let Some(pos) = groups.iter().position(|(k, _)| k == &key) {
-                groups[pos].1.push(f);
-            } else {
-                groups.push((key, vec![f]));
-            }
-        }
-        groups
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 
     /// Flat-mode collapse adapter. Collects the `&[Finding]` parameter into
     /// `Vec<&Finding>` and delegates to `collapse_findings_pass_refs`.
     ///
     /// Uses the `findings` PARAMETER — `TerminalReporter` has no `findings` field.
     ///
     /// BC-2.11.025 / ADR-0003 "Collapse-API Shape".

---- mitre_flag_emits_tactic_headers_and_collapse_suffix stdout ----

thread 'mitre_flag_emits_tactic_headers_and_collapse_suffix' (177811208) panicked at tests/cli_integration_tests.rs:215:5:
BC-2.11.030 PC-2: `--mitre` must collapse ≥2 identical findings with '(xN)' suffix; got stdout:
WIRERUST TRIAGE REPORT
────────────────────────────────────────
  Packets: 16  Bytes: 929  Hosts: 2

PROTOCOLS
────────────────────────────────────────
  Tcp: 16

SERVICES
────────────────────────────────────────

failures:
    mitre_flag_emits_tactic_headers_and_collapse_suffix

test result: FAILED. 8 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
