*** src/reporter/terminal.rs:375:66: replace == with != in TerminalReporter::collapse_findings_pass_refs

*** mutation diff:
--- src/reporter/terminal.rs
+++ replace == with != in TerminalReporter::collapse_findings_pass_refs
@@ -367,17 +367,17 @@
         for f in refs {
             let key = CollapseKey {
                 category: f.category,
                 verdict: f.verdict,
                 confidence: f.confidence,
                 summary: f.summary.clone(),
             };
             // Linear-scan PartialEq: find an existing group or create a new one.
-            if let Some(pos) = groups.iter().position(|(k, _)| k == &key) {
+            if let Some(pos) = groups.iter().position(|(k, _)| k != /* ~ changed by cargo-mutants ~ */ &key) {
                 groups[pos].1.push(f);
             } else {
                 groups.push((key, vec![f]));
             }
         }
         groups
     }

---- mitre_flag_emits_tactic_headers_and_collapse_suffix stdout ----

thread 'mitre_flag_emits_tactic_headers_and_collapse_suffix' (177837052) panicked at tests/cli_integration_tests.rs:215:5:
BC-2.11.030 PC-2: `--mitre` must collapse ≥2 identical findings with '(xN)' suffix; got stdout:
WIRERUST TRIAGE REPORT
────────────────────────────────────────
  Packets: 16  Bytes: 929  Hosts: 2

PROTOCOLS
────────────────────────────────────────
  Tcp: 16

SERVICES
────────────────────────────────────────

failures:
    mitre_flag_emits_tactic_headers_and_collapse_suffix

test result: FAILED. 8 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
