*** src/reporter/terminal.rs:394:9: replace TerminalReporter::collapse_findings_pass -> Vec<(CollapseKey, Vec<&'a Finding>)> with vec![]

*** mutation diff:
--- src/reporter/terminal.rs
+++ replace TerminalReporter::collapse_findings_pass -> Vec<(CollapseKey, Vec<&'a Finding>)> with vec![]
@@ -386,18 +386,17 @@
     ///
     /// Uses the `findings` PARAMETER — `TerminalReporter` has no `findings` field.
     ///
     /// BC-2.11.025 / ADR-0003 "Collapse-API Shape".
     fn collapse_findings_pass<'a>(
         &self,
         findings: &'a [Finding],
     ) -> Vec<(CollapseKey, Vec<&'a Finding>)> {
-        let refs: Vec<&Finding> = findings.iter().collect();
-        self.collapse_findings_pass_refs(&refs)
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 
     /// Renders the FINDINGS section in collapsed flat mode.
     ///
     /// Calls `collapse_findings_pass` to build insertion-ordered groups, then for
     /// each group:
     ///   - N == 1 (singleton): delegates to `render_finding_flat` for byte-identical
     ///     output compared to pre-v0.8.0 (no count suffix, all evidence rendered, MITRE

---- story_118::test_BC_2_11_010_escape_in_collapse_path stdout ----

thread 'story_118::test_BC_2_11_010_escape_in_collapse_path' (177882524) panicked at tests/reporter_terminal_tests.rs:3655:9:
BC-2.11.010 inv4: escaped form '\u{1b}' must appear from collapsed evidence; got:
WIRERUST TRIAGE REPORT
────────────────────────────────────────
  Packets: 0  Bytes: 0  Hosts: 0

PROTOCOLS
────────────────────────────────────────

FINDINGS
────────────────────────────────────────

---- story_118::test_BC_2_11_013_grouped_mode_suffix_free stdout ----

thread 'story_118::test_BC_2_11_013_grouped_mode_suffix_free' (177882525) panicked at tests/reporter_terminal_tests.rs:3718:9:
BC-2.11.013 inv4 contrast: flat collapse mode must produce '(x50)' for 50 identical findings (proves grouped bypass is intentional); got:
WIRERUST TRIAGE REPORT
────────────────────────────────────────
  Packets: 0  Bytes: 0  Hosts: 0

PROTOCOLS
────────────────────────────────────────

FINDINGS
────────────────────────────────────────

---- story_118::test_BC_2_11_025_key_discriminator_category stdout ----

thread 'story_118::test_BC_2_11_025_key_discriminator_category' (177882533) panicked at tests/reporter_terminal_tests.rs:2063:9:
BC-2.11.025 inv1: Anomaly category group must appear; got:
WIRERUST TRIAGE REPORT
────────────────────────────────────────
  Packets: 0  Bytes: 0  Hosts: 0

PROTOCOLS
────────────────────────────────────────

FINDINGS
────────────────────────────────────────

failures:
    story_118::test_BC_2_11_010_escape_in_collapse_path
    story_118::test_BC_2_11_013_grouped_mode_suffix_free
    story_118::test_BC_2_11_017_collapsed_mitre_line_from_representative
    story_118::test_BC_2_11_025_deterministic_output_same_input
    story_118::test_BC_2_11_025_first_occurrence_order
    story_118::test_BC_2_11_025_flood_canonical_empty_ua_five_findings
    story_118::test_BC_2_11_025_grouped_mode_bypasses_collapse
    story_118::test_BC_2_11_025_identical_findings_collapse_to_one_group
    story_118::test_BC_2_11_025_key_discriminator_category
    story_118::test_BC_2_11_025_key_discriminator_evidence_nondiscriminating
    story_118::test_BC_2_11_025_raw_byte_key_esc_distinguishes_groups
    story_118::test_BC_2_11_025_severity_agnostic_collapse_likely_high

test result: FAILED. 77 passed; 45 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
