*** src/reporter/terminal.rs:413:9: replace TerminalReporter::render_findings_collapsed with ()

*** mutation diff:
--- src/reporter/terminal.rs
+++ replace TerminalReporter::render_findings_collapsed with ()
@@ -405,62 +405,17 @@
     ///   - N >= 2: renders header with ` (xN)` suffix appended BEFORE colorization (so
     ///     the suffix is inside the ANSI color span), then up to K=3 sampled evidence
     ///     lines (first `min(N, COLLAPSE_EVIDENCE_SAMPLES)` members' `evidence[0]` in
     ///     positional order; the window does NOT slide past empty-evidence members), then
     ///     the MITRE line from `group_members[0]` if non-empty.
     ///
     /// BC-2.11.025 / BC-2.11.026 / BC-2.11.027 / BC-2.11.010.
     fn render_findings_collapsed(&self, out: &mut String, findings: &[Finding]) {
-        let groups = self.collapse_findings_pass(findings);
-        for (_key, members) in &groups {
-            let n = members.len();
-            if n == 1 {
-                // Singleton: byte-identical to pre-v0.8.0 flat rendering.
-                self.render_finding_flat(out, members[0]);
-            } else {
-                // N >= 2: build header with (xN) suffix, colorize the full string.
-                let rep = members[0];
-                let escaped_summary = escape_for_terminal(&rep.summary);
-                let header_text = format!(
-                    "[{}] {} ({}) - {} (x{})",
-                    rep.category, rep.verdict, rep.confidence, escaped_summary, n
-                );
-                let colored = if self.use_color {
-                    match rep.verdict {
-                        Verdict::Likely => match rep.confidence {
-                            Confidence::High => header_text.red().bold().to_string(),
-                            _ => header_text.yellow().to_string(),
-                        },
-                        Verdict::Possible => header_text.yellow().to_string(),
-                        Verdict::Inconclusive => header_text.cyan().to_string(),
-                        Verdict::Unlikely => header_text.dimmed().to_string(),
-                    }
-                } else {
-                    header_text
-                };
-                out.push_str(&format!("  {colored}\n"));
-
-                // Evidence sampling: inspect first min(N, K) members positionally.
-                // The window does NOT slide past empty-evidence members (BC-2.11.027 inv2).
-                let window = members.len().min(COLLAPSE_EVIDENCE_SAMPLES);
-                for member in &members[..window] {
-                    if let Some(ev) = member.evidence.first() {
-                        let escaped_ev = escape_for_terminal(ev);
-                        out.push_str(&format!("    > {escaped_ev}\n"));
-                    }
-                }
-
-                // MITRE line from group_members[0] only, if non-empty (BC-2.11.026 pc7).
-                if !rep.mitre_techniques.is_empty() {
-                    let ids = rep.mitre_techniques.join(", ");
-                    out.push_str(&format!("    MITRE: {ids}\n"));
-                }
-            }
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Renders the FINDINGS section grouped by MITRE tactic. Each tactic
     /// header is `## Tactic Name`; sections appear in
     /// [`all_tactics_in_report_order`] order with an Uncategorized bucket
     /// last that holds findings with no technique or an unknown ID.
     /// Within each bucket, findings sort ascending by verdict-rank
     /// (Likely=0, Possible=1, Inconclusive=2, Unlikely=3), then ascending by

---- story_118::test_BC_2_11_013_grouped_mode_suffix_free stdout ----

thread 'story_118::test_BC_2_11_013_grouped_mode_suffix_free' (177928654) panicked at tests/reporter_terminal_tests.rs:3718:9:
BC-2.11.013 inv4 contrast: flat collapse mode must produce '(x50)' for 50 identical findings (proves grouped bypass is intentional); got:
WIRERUST TRIAGE REPORT
────────────────────────────────────────
  Packets: 0  Bytes: 0  Hosts: 0

PROTOCOLS
────────────────────────────────────────

FINDINGS
────────────────────────────────────────

---- story_118::test_BC_2_11_025_key_discriminator_evidence_nondiscriminating stdout ----

thread 'story_118::test_BC_2_11_025_key_discriminator_evidence_nondiscriminating' (177928663) panicked at tests/reporter_terminal_tests.rs:2018:9:
assertion `left == right` failed: BC-2.11.025 pc4: two findings differing only in evidence must collapse to 1 header line; found 0 occurrences of 'SameSummary'; got:
WIRERUST TRIAGE REPORT
────────────────────────────────────────
  Packets: 0  Bytes: 0  Hosts: 0

PROTOCOLS
────────────────────────────────────────

FINDINGS
────────────────────────────────────────

---- story_118::test_BC_2_11_025_identical_findings_collapse_to_one_group stdout ----

thread 'story_118::test_BC_2_11_025_identical_findings_collapse_to_one_group' (177928661) panicked at tests/reporter_terminal_tests.rs:1891:9:
assertion `left == right` failed: BC-2.11.025 pc1: 5 identical findings must collapse to exactly 1 header line; found 0 occurrences of '[Anomaly] INCONCLUSIVE (LOW) - Flood' in:
WIRERUST TRIAGE REPORT
────────────────────────────────────────
  Packets: 0  Bytes: 0  Hosts: 0

PROTOCOLS
────────────────────────────────────────

FINDINGS
────────────────────────────────────────

failures:
    story_118::test_BC_2_11_010_escape_in_collapse_path
    story_118::test_BC_2_11_013_grouped_mode_suffix_free
    story_118::test_BC_2_11_017_collapsed_mitre_line_from_representative
    story_118::test_BC_2_11_025_deterministic_output_same_input
    story_118::test_BC_2_11_025_first_occurrence_order
    story_118::test_BC_2_11_025_flood_canonical_empty_ua_five_findings
    story_118::test_BC_2_11_025_grouped_mode_bypasses_collapse
    story_118::test_BC_2_11_025_identical_findings_collapse_to_one_group
    story_118::test_BC_2_11_025_key_discriminator_category
    story_118::test_BC_2_11_025_key_discriminator_evidence_nondiscriminating
    story_118::test_BC_2_11_025_raw_byte_key_esc_distinguishes_groups
    story_118::test_BC_2_11_025_severity_agnostic_collapse_likely_high

test result: FAILED. 77 passed; 45 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
