*** src/reporter/terminal.rs:453:20: delete ! in TerminalReporter::render_findings_collapsed

*** mutation diff:
--- src/reporter/terminal.rs
+++ delete ! in TerminalReporter::render_findings_collapsed
@@ -445,17 +445,17 @@
                 for member in &members[..window] {
                     if let Some(ev) = member.evidence.first() {
                         let escaped_ev = escape_for_terminal(ev);
                         out.push_str(&format!("    > {escaped_ev}\n"));
                     }
                 }
 
                 // MITRE line from group_members[0] only, if non-empty (BC-2.11.026 pc7).
-                if !rep.mitre_techniques.is_empty() {
+                if  /* ~ changed by cargo-mutants ~ */rep.mitre_techniques.is_empty() {
                     let ids = rep.mitre_techniques.join(", ");
                     out.push_str(&format!("    MITRE: {ids}\n"));
                 }
             }
         }
     }
 
     /// Renders the FINDINGS section grouped by MITRE tactic. Each tactic

---- story_118::test_BC_2_11_017_collapsed_mitre_line_from_representative stdout ----

thread 'story_118::test_BC_2_11_017_collapsed_mitre_line_from_representative' (178074751) panicked at tests/reporter_terminal_tests.rs:3764:9:
BC-2.11.017 pc6: MITRE line must read 'MITRE: T1036' (bare ID, from member[0]); got:
WIRERUST TRIAGE REPORT
────────────────────────────────────────
  Packets: 0  Bytes: 0  Hosts: 0

PROTOCOLS
────────────────────────────────────────

FINDINGS
────────────────────────────────────────
  [Anomaly] INCONCLUSIVE (LOW) - MitreRepresentative (x2)

---- story_118::test_BC_2_11_026_mitre_line_from_representative_finding stdout ----

thread 'story_118::test_BC_2_11_026_mitre_line_from_representative_finding' (178074768) panicked at tests/reporter_terminal_tests.rs:2923:9:
BC-2.11.026 pc7: MITRE line must source from group_members[0] ('T1036'); got:
WIRERUST TRIAGE REPORT
────────────────────────────────────────
  Packets: 0  Bytes: 0  Hosts: 0

PROTOCOLS
────────────────────────────────────────

FINDINGS
────────────────────────────────────────
  [Anomaly] INCONCLUSIVE (LOW) - SharedKey (x3)

---- story_118::test_BC_2_11_026_no_mitre_line_when_representative_has_no_mitre stdout ----

thread 'story_118::test_BC_2_11_026_no_mitre_line_when_representative_has_no_mitre' (178074769) panicked at tests/reporter_terminal_tests.rs:3950:9:
BC-2.11.026 supplementary: no MITRE line when representative members[0] has mitre_techniques=[]; members[1] T1036 must be silently elided; got:
WIRERUST TRIAGE REPORT
────────────────────────────────────────
  Packets: 0  Bytes: 0  Hosts: 0

PROTOCOLS
────────────────────────────────────────

FINDINGS
────────────────────────────────────────
  [Anomaly] INCONCLUSIVE (LOW) - NoRepMitre (x2)

failures:
    story_118::test_BC_2_11_017_collapsed_mitre_line_from_representative
    story_118::test_BC_2_11_026_mitre_line_from_representative_finding
    story_118::test_BC_2_11_026_no_mitre_line_when_representative_has_no_mitre
    story_122::test_BC_2_11_028_ac006_flat_collapsed_byte_identical_to_old_flatcollapsed_variant

test result: FAILED. 118 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
