*** src/reporter/terminal.rs:50:5: replace escape_for_terminal -> String with String::new()

*** mutation diff:
--- src/reporter/terminal.rs
+++ replace escape_for_terminal -> String with String::new()
@@ -42,32 +42,17 @@
 /// equivalent of ESC[. Escaping them closes a narrow but real vector.
 ///
 /// **Why not `str::escape_default`?** It routes *every* character through
 /// `char::escape_default`, which escapes non-ASCII as `\u{...}` and would
 /// mangle a Cyrillic hostname like `пример.рф` into `\u{43f}\u{440}...`.
 /// See ADR 0003 (`docs/adr/0003-reporting-pipeline-layering.md`) for the
 /// layering rationale and the empirical verification.
 fn escape_for_terminal(s: &str) -> String {
-    let mut out = String::with_capacity(s.len());
-    for c in s.chars() {
-        // Escape C0 (0x00-0x1f), DEL (0x7f), C1 (U+0080-U+009F), and backslash.
-        // C1 codepoints like U+0085 (NEL) and U+009B (CSI — 8-bit equivalent of
-        // ESC[) are valid multi-byte UTF-8 in a `String` but can be interpreted
-        // as controls by terminals in 8-bit C1 mode (DEC S8C1T). Escaping them
-        // is cheap insurance.
-        if c.is_ascii_control() || ('\u{80}'..='\u{9f}').contains(&c) || c == '\\' {
-            for e in c.escape_default() {
-                out.push(e);
-            }
-        } else {
-            out.push(c);
-        }
-    }
-    out
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Ascending sort rank for [`Verdict`]: lower value → appears first in a sorted bucket.
 ///
 /// BC-2.11.014 / BC-2.11.033 PC-5: both `render_findings_grouped` and
 /// `render_findings_grouped_collapsed` share this single source (BC-014 single-source rule).
 fn verdict_rank(v: Verdict) -> u8 {
     match v {

---- reporter::terminal::tests::escapes_bel_and_del stdout ----

thread 'reporter::terminal::tests::escapes_bel_and_del' (177216564) panicked at src/reporter/terminal.rs:771:9:
assertion `left == right` failed
  left: ""
 right: "ring\\u{7}bye\\u{7f}"

---- reporter::terminal::tests::escapes_c1_nel_and_csi stdout ----

thread 'reporter::terminal::tests::escapes_c1_nel_and_csi' (177216565) panicked at src/reporter/terminal.rs:830:9:
assertion `left == right` failed
  left: ""
 right: "line1\\u{85}line2"

---- reporter::terminal::tests::escapes_backslash stdout ----

thread 'reporter::terminal::tests::escapes_backslash' (177216563) panicked at src/reporter/terminal.rs:788:9:
assertion `left == right` failed
  left: ""
 right: "a\\\\b"

failures:
    reporter::terminal::tests::escapes_backslash
    reporter::terminal::tests::escapes_bel_and_del
    reporter::terminal::tests::escapes_c1_nel_and_csi
    reporter::terminal::tests::escapes_c1_range_boundaries
    reporter::terminal::tests::escapes_esc_byte
    reporter::terminal::tests::escapes_tab_newline_cr_as_short_forms
    reporter::terminal::tests::mixed_content_escapes_only_dangerous_bytes
    reporter::terminal::tests::preserves_cyrillic
    reporter::terminal::tests::preserves_emoji
    reporter::terminal::tests::preserves_printable_ascii
    reporter::terminal::tests::prop_escape_is_length_conserving
    reporter::terminal::tests::prop_non_ascii_unicode_above_c1_unchanged

test result: FAILED. 74 passed; 13 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.78s

*** result: Failure(101)
