*** src/reporter/terminal.rs:549:22: replace == with != in TerminalReporter::render_findings_grouped_collapsed

*** mutation diff:
--- src/reporter/terminal.rs
+++ replace == with != in TerminalReporter::render_findings_grouped_collapsed
@@ -541,17 +541,17 @@
             // Build sorted &Finding refs and delegate to the shared collapse helper.
             // BC-2.11.033 Inv3 / BC-2.11.025 Inv1 / BC-2.11.031 PC-3: use the shared
             // four-tuple (category, verdict, confidence, summary) collapse key via
             // collapse_findings_pass_refs — no inline summary-only keying.
             let bucket_refs: Vec<&Finding> = items.iter().map(|(_, f)| *f).collect();
             let groups = self.collapse_findings_pass_refs(&bucket_refs);
             for (_key, members) in &groups {
                 let n = members.len();
-                if n == 1 {
+                if n != /* ~ changed by cargo-mutants ~ */ 1 {
                     // Singleton: byte-identical to {Grouped, Expanded}.
                     self.render_finding_grouped(out, members[0]);
                 } else {
                     // N >= 2: build header with (xN) suffix, colorize the full
                     // string (suffix is inside the ANSI color span — BC-2.11.031 PC-3).
                     let rep = members[0];
                     // escape_for_terminal (char::escape_default, U+NN format) —
                     // BC-2.11.031 PC-5 / BC-2.11.032 PC-6 / VP-012 / ADR-0003.

---- mitre_flag_emits_tactic_headers_and_collapse_suffix stdout ----

thread 'mitre_flag_emits_tactic_headers_and_collapse_suffix' (178150149) panicked at tests/cli_integration_tests.rs:215:5:
BC-2.11.030 PC-2: `--mitre` must collapse ≥2 identical findings with '(xN)' suffix; got stdout:
WIRERUST TRIAGE REPORT
────────────────────────────────────────
  Packets: 16  Bytes: 929  Hosts: 2

PROTOCOLS
────────────────────────────────────────
  Tcp: 16

SERVICES
────────────────────────────────────────

failures:
    mitre_flag_emits_tactic_headers_and_collapse_suffix

test result: FAILED. 8 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
