*** src/reporter/terminal.rs:57:33: replace || with && in escape_for_terminal

*** mutation diff:
--- src/reporter/terminal.rs
+++ replace || with && in escape_for_terminal
@@ -49,17 +49,17 @@
 fn escape_for_terminal(s: &str) -> String {
     let mut out = String::with_capacity(s.len());
     for c in s.chars() {
         // Escape C0 (0x00-0x1f), DEL (0x7f), C1 (U+0080-U+009F), and backslash.
         // C1 codepoints like U+0085 (NEL) and U+009B (CSI — 8-bit equivalent of
         // ESC[) are valid multi-byte UTF-8 in a `String` but can be interpreted
         // as controls by terminals in 8-bit C1 mode (DEC S8C1T). Escaping them
         // is cheap insurance.
-        if c.is_ascii_control() || ('\u{80}'..='\u{9f}').contains(&c) || c == '\\' {
+        if c.is_ascii_control() && /* ~ changed by cargo-mutants ~ */ ('\u{80}'..='\u{9f}').contains(&c) || c == '\\' {
             for e in c.escape_default() {
                 out.push(e);
             }
         } else {
             out.push(c);
         }
     }
     out

---- reporter::terminal::tests::escapes_c1_nel_and_csi stdout ----

thread 'reporter::terminal::tests::escapes_c1_nel_and_csi' (177243451) panicked at src/reporter/terminal.rs:845:9:
assertion `left == right` failed
  left: "line1\u{85}line2"
 right: "line1\\u{85}line2"

---- reporter::terminal::tests::escapes_bel_and_del stdout ----

thread 'reporter::terminal::tests::escapes_bel_and_del' (177243450) panicked at src/reporter/terminal.rs:786:9:
assertion `left == right` failed
  left: "ring\u{7}bye\u{7f}"
 right: "ring\\u{7}bye\\u{7f}"

---- reporter::terminal::tests::escapes_c1_range_boundaries stdout ----

thread 'reporter::terminal::tests::escapes_c1_range_boundaries' (177243452) panicked at src/reporter/terminal.rs:857:9:
assertion `left == right` failed
  left: "\u{80}"
 right: "\\u{80}"

failures:
    reporter::terminal::tests::escapes_bel_and_del
    reporter::terminal::tests::escapes_c1_nel_and_csi
    reporter::terminal::tests::escapes_c1_range_boundaries
    reporter::terminal::tests::escapes_esc_byte
    reporter::terminal::tests::escapes_tab_newline_cr_as_short_forms
    reporter::terminal::tests::mixed_content_escapes_only_dangerous_bytes

test result: FAILED. 81 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.79s

*** result: Failure(101)
