*** src/reporter/terminal.rs:57:76: replace == with != in escape_for_terminal

*** mutation diff:
--- src/reporter/terminal.rs
+++ replace == with != in escape_for_terminal
@@ -49,17 +49,17 @@
 fn escape_for_terminal(s: &str) -> String {
     let mut out = String::with_capacity(s.len());
     for c in s.chars() {
         // Escape C0 (0x00-0x1f), DEL (0x7f), C1 (U+0080-U+009F), and backslash.
         // C1 codepoints like U+0085 (NEL) and U+009B (CSI — 8-bit equivalent of
         // ESC[) are valid multi-byte UTF-8 in a `String` but can be interpreted
         // as controls by terminals in 8-bit C1 mode (DEC S8C1T). Escaping them
         // is cheap insurance.
-        if c.is_ascii_control() || ('\u{80}'..='\u{9f}').contains(&c) || c == '\\' {
+        if c.is_ascii_control() || ('\u{80}'..='\u{9f}').contains(&c) || c != /* ~ changed by cargo-mutants ~ */ '\\' {
             for e in c.escape_default() {
                 out.push(e);
             }
         } else {
             out.push(c);
         }
     }
     out

---- reporter::terminal::tests::escapes_backslash stdout ----

thread 'reporter::terminal::tests::escapes_backslash' (177252570) panicked at src/reporter/terminal.rs:803:9:
assertion `left == right` failed
  left: "a\\b"
 right: "a\\\\b"

---- reporter::terminal::tests::escapes_c1_range_boundaries stdout ----

thread 'reporter::terminal::tests::escapes_c1_range_boundaries' (177252573) panicked at src/reporter/terminal.rs:859:9:
assertion `left == right` failed
  left: "\\u{a0}"
 right: "\u{a0}"

---- reporter::terminal::tests::mixed_content_escapes_only_dangerous_bytes stdout ----

thread 'reporter::terminal::tests::mixed_content_escapes_only_dangerous_bytes' (177252576) panicked at src/reporter/terminal.rs:828:9:
assertion `left == right` failed
  left: "\\u{43f}\\u{440}\\u{438}\\u{43c}\\u{435}\\u{440}\\u{1b}\\u{1f980}"
 right: "пример\\u{1b}🦀"

failures:
    reporter::terminal::tests::escapes_backslash
    reporter::terminal::tests::escapes_c1_range_boundaries
    reporter::terminal::tests::mixed_content_escapes_only_dangerous_bytes
    reporter::terminal::tests::preserves_cyrillic
    reporter::terminal::tests::preserves_emoji
    reporter::terminal::tests::prop_escape_is_length_conserving
    reporter::terminal::tests::prop_no_dangerous_bytes_survive
    reporter::terminal::tests::prop_non_ascii_unicode_above_c1_unchanged
    reporter::terminal::tests::prop_printable_ascii_unchanged

test result: FAILED. 78 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.79s

*** result: Failure(101)
