*** src/reporter/terminal.rs:592:24: delete ! in TerminalReporter::render_findings_grouped_collapsed

*** mutation diff:
--- src/reporter/terminal.rs
+++ delete ! in TerminalReporter::render_findings_grouped_collapsed
@@ -584,17 +584,17 @@
                     for member in &members[..window] {
                         if let Some(ev) = member.evidence.first() {
                             let escaped_ev = escape_for_terminal(ev);
                             out.push_str(&format!("    > {escaped_ev}\n"));
                         }
                     }
 
                     // MITRE line from members[0] with em-dash name expansion (BC-2.11.034).
-                    if !rep.mitre_techniques.is_empty() {
+                    if  /* ~ changed by cargo-mutants ~ */rep.mitre_techniques.is_empty() {
                         let ids = rep.mitre_techniques.join(", ");
                         match rep
                             .mitre_techniques
                             .first()
                             .and_then(|id| technique_name(id.as_str()))
                         {
                             Some(name) => {
                                 out.push_str(&format!("    MITRE: {ids} \u{2014} {name}\n"))

---- story_119::test_BC_2_11_034_divergent_mitre_representative_sourcing stdout ----

thread 'story_119::test_BC_2_11_034_divergent_mitre_representative_sourcing' (178259720) panicked at tests/reporter_terminal_tests.rs:6367:9:
AC-020: members[0] technique T1046 must appear in terminal output; got:
WIRERUST TRIAGE REPORT
────────────────────────────────────────
  Packets: 0  Bytes: 0  Hosts: 0

PROTOCOLS
────────────────────────────────────────

FINDINGS
────────────────────────────────────────
  ## Discovery

---- story_119::test_BC_2_11_034_empty_mitre_techniques_no_mitre_line stdout ----

thread 'story_119::test_BC_2_11_034_empty_mitre_techniques_no_mitre_line' (178259721) panicked at tests/reporter_terminal_tests.rs:6709:9:
EC-006: no MITRE line must appear when members[0].mitre_techniques is empty; got:
WIRERUST TRIAGE REPORT
────────────────────────────────────────
  Packets: 0  Bytes: 0  Hosts: 0

PROTOCOLS
────────────────────────────────────────

FINDINGS
────────────────────────────────────────
  ## Uncategorized

---- story_119::test_BC_2_11_034_unknown_technique_in_grouped_collapse stdout ----

thread 'story_119::test_BC_2_11_034_unknown_technique_in_grouped_collapse' (178259724) panicked at tests/reporter_terminal_tests.rs:6274:9:
AC-018 edge: unknown technique ID must produce `(unknown)` format on MITRE line; got:
WIRERUST TRIAGE REPORT
────────────────────────────────────────
  Packets: 0  Bytes: 0  Hosts: 0

PROTOCOLS
────────────────────────────────────────

FINDINGS
────────────────────────────────────────
  ## Uncategorized

failures:
    story_119::test_BC_2_11_034_divergent_mitre_representative_sourcing
    story_119::test_BC_2_11_034_empty_mitre_techniques_no_mitre_line
    story_119::test_BC_2_11_034_grouped_collapse_mitre_line_em_dash_format
    story_119::test_BC_2_11_034_unknown_technique_in_grouped_collapse

test result: FAILED. 118 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
