*** src/reporter/terminal.rs:73:5: replace verdict_rank -> u8 with 1

*** mutation diff:
--- src/reporter/terminal.rs
+++ replace verdict_rank -> u8 with 1
@@ -65,22 +65,17 @@
     out
 }
 
 /// Ascending sort rank for [`Verdict`]: lower value → appears first in a sorted bucket.
 ///
 /// BC-2.11.014 / BC-2.11.033 PC-5: both `render_findings_grouped` and
 /// `render_findings_grouped_collapsed` share this single source (BC-014 single-source rule).
 fn verdict_rank(v: Verdict) -> u8 {
-    match v {
-        Verdict::Likely => 0,
-        Verdict::Possible => 1,
-        Verdict::Inconclusive => 2,
-        Verdict::Unlikely => 3,
-    }
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 /// Ascending sort rank for [`Confidence`]: lower value → appears first in a sorted bucket.
 ///
 /// BC-2.11.014 / BC-2.11.033 PC-6: both grouped render functions share this single source.
 fn confidence_rank(c: Confidence) -> u8 {
     match c {
         Confidence::High => 0,

---- story_078::test_BC_2_11_014_sort_by_verdict_within_bucket stdout ----

thread 'story_078::test_BC_2_11_014_sort_by_verdict_within_bucket' (177301447) panicked at tests/reporter_terminal_tests.rs:832:9:
BC-2.11.014 pc1: Likely (rank 0) must render before Inconclusive (rank 1); pos_likely=577, pos_inconclusive=495

failures:
    story_078::test_BC_2_11_014_sort_by_verdict_within_bucket

test result: FAILED. 121 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
