*** src/reporter/terminal.rs:85:5: replace confidence_rank -> u8 with 1

*** mutation diff:
--- src/reporter/terminal.rs
+++ replace confidence_rank -> u8 with 1
@@ -77,21 +77,17 @@
         Verdict::Unlikely => 3,
     }
 }
 
 /// Ascending sort rank for [`Confidence`]: lower value → appears first in a sorted bucket.
 ///
 /// BC-2.11.014 / BC-2.11.033 PC-6: both grouped render functions share this single source.
 fn confidence_rank(c: Confidence) -> u8 {
-    match c {
-        Confidence::High => 0,
-        Confidence::Medium => 1,
-        Confidence::Low => 2,
-    }
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 /// Maximum number of representative evidence lines rendered per collapsed group.
 ///
 /// BC-2.11.027 invariant 1: K = 3 is a hardcoded named constant, not a magic number.
 /// The collapse pass inspects the first `min(N, COLLAPSE_EVIDENCE_SAMPLES)` members
 /// of the group and emits `evidence[0]` from each inspected member (if non-empty).
 /// The window is positional and does NOT slide past empty-evidence members.

---- story_078::test_BC_2_11_014_sort_by_confidence_within_same_verdict stdout ----

thread 'story_078::test_BC_2_11_014_sort_by_confidence_within_same_verdict' (177353783) panicked at tests/reporter_terminal_tests.rs:871:9:
BC-2.11.014 pc2: Likely/High (confidence rank 0) must render before Likely/Low (confidence rank 2); pos_high=565, pos_low=488

failures:
    story_078::test_BC_2_11_014_sort_by_confidence_within_same_verdict

test result: FAILED. 121 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
